{
    "ACH-000425": "Cell Line: UACC62  1. Cell Type and Origin: Melanoma cell line derived from skin; primary disease is cutaneous melanoma.  2. Molecular Signatures:  - Mutations: BRAF V600E (common driver mutation), CDKN2A loss.  - Protein expression: High MITF (melanoma-associated transcription factor), moderate PTEN expression.  3. Signaling Pathways:  - Hyperactivated MAPK/ERK pathway (due to BRAF V600E).  - Dysregulated PI3K/AKT pathway (modulated by PTEN status).  4. Known Drug Response Profiles:  - Sensitive to BRAF inhibitors (e.g., vemurafenib, dabrafenib).  - Resistance mechanisms include MAPK pathway reactivation.  5. Cellular Microenvironment:  - Limited data on ECM composition; typically cultured as adherent monolayer.  - Low immune cell interaction in vitro.  6. Key Biomarkers:  - BRAF V600E (therapeutic target).  - MITF (prognostic marker).  - CDKN2A loss (associated with cell cycle dysregulation).",
    "ACH-000615": "1. Cell type and origin: Melanoma cell line derived from skin, representing malignant skin cancer.  2. Molecular signatures:  - Mutations: BRAF V600E (common driver mutation), TP53 mutation, PTEN loss.  - Protein expression: High MITF (melanocyte lineage marker), moderate PD-L1 expression.  3. Signaling pathways:  - Hyperactivated MAPK/ERK pathway (due to BRAF V600E).  - PI3K/AKT pathway dysregulation (linked to PTEN loss).  - Moderate WNT/β-catenin signaling activity.  4. Known drug response profiles:  - Sensitive to BRAF inhibitors (vemurafenib, dabrafenib).  - Resistance to MEK inhibitors (trametinib) as monotherapy.  - Partial sensitivity to immunotherapies (anti-PD-1).  5. Cellular microenvironment:  - Limited extracellular matrix interaction in vitro.  - Low baseline immune cell infiltration (low immunogenicity in vivo).  6. Key biomarkers:  - BRAF V600E (predictive for BRAF inhibitor response).  - PD-L1 (potential immunotherapy biomarker).  - MITF (prognostic for melanoma aggressiveness).",
    "ACH-000579": "Cell Line: UACC-257  1. Cell Type and Origin: Melanoma cell line derived from skin; primary disease is cutaneous melanoma.  2. Molecular Signatures:  - Common mutations in BRAF (V600E), CDKN2A deletion, and PTEN loss.  - Overexpression of MITF and cyclin D1; low expression of PTEN protein.  3. Signaling Pathways:  - Hyperactivated MAPK/ERK pathway due to BRAF V600E mutation.  - Dysregulated PI3K/AKT pathway from PTEN loss.  - Elevated Wnt/β-catenin signaling.  4. Known Drug Response Profiles:  - Sensitive to BRAF inhibitors (vemurafenib, dabrafenib).  - Resistance to single-agent MEK inhibitors; synergistic sensitivity to BRAF+MEK combo.  - Moderate sensitivity to immunotherapy (anti-PD-1).  5. Cellular Microenvironment:  - Limited data on native microenvironment; typically cultured as adherent monolayer.  - Low endogenous immune cell interaction in vitro.  6. Key Biomarkers:  - BRAF V600E as primary therapeutic target.  - High MITF expression associated with proliferation.  - PTEN loss as a resistance marker to targeted therapy.",
    "ACH-000750": "1. Cell type and origin: LOX IMVI is a human melanoma cell line derived from a lymph node metastasis. It represents an aggressive form of skin cancer.  2. Molecular signatures: Harbors common melanoma-associated mutations, including BRAF V600E and NRAS mutations. Overexpresses MITF and lacks PTEN expression, contributing to proliferation and survival.  3. Signaling pathways: Hyperactivation of MAPK/ERK and PI3K/AKT pathways due to BRAF mutation and PTEN loss. Wnt/β-catenin signaling may also be dysregulated.  4. Known drug response profiles: Sensitive to BRAF inhibitors (e.g., vemurafenib) but may develop resistance. Exhibits variable responses to MEK and PI3K inhibitors.  5. Cellular microenvironment: Derived from a metastatic site, likely adapted to lymph node-specific ECM (e.g., fibronectin-rich). Limited data on immune cell interactions in culture.  6. Key biomarkers: BRAF V600E (therapeutic target), MITF (prognostic marker), PTEN loss (predictor of PI3K pathway dependency). Overexpression of ABC transporters may contribute to drug resistance.",
    "ACH-000730": "1. Cell type and origin: Melanoma cell line derived from metastatic lymph node tissue in a skin cancer (melanoma) patient.  2. Molecular signatures: Harbors BRAF V600E mutation; expresses high levels of MITF and SOX10. Common melanoma-associated alterations in CDKN2A and PTEN.  3. Signaling pathways: Hyperactivated MAPK/ERK pathway due to BRAF mutation; PI3K/AKT pathway dysregulation. Wnt/β-catenin signaling may be involved.  4. Known drug response profiles: Sensitive to BRAF inhibitors (e.g., vemurafenib) and MEK inhibitors (e.g., trametinib); potential resistance mechanisms via PI3K/AKT upregulation.  5. Cellular microenvironment: Lymph node metastatic origin suggests potential interaction with immune cells (e.g., T cells, dendritic cells); extracellular matrix components may include fibronectin and collagen.  6. Key biomarkers: BRAF V600E (therapeutic target); MITF (prognostic marker); PD-L1 expression (immune checkpoint relevance).",
    "ACH-001190": "1. Cell type and origin: SK-MEL-2 is a human melanoma cell line derived from skin, representing a model for cutaneous malignant melanoma.  2. Molecular signatures: Harbors mutations in NRAS (Q61R), CDKN2A (loss), and PTEN (loss). Overexpresses MITF and lacks BRAF mutations.  3. Signaling pathways: Hyperactivated MAPK/ERK pathway due to NRAS mutation; PI3K/AKT pathway dysregulated via PTEN loss.  4. Known drug response profiles: Resistant to BRAF inhibitors (e.g., vemurafenib); sensitive to MEK inhibitors (e.g., trametinib) and PI3K/AKT pathway inhibitors.  5. Cellular microenvironment: Exhibits moderate PD-L1 expression; low immune infiltration in vitro. ECM interactions involve integrin-mediated adhesion.  6. Key biomarkers: NRAS mutation (predictive of MEK inhibitor response); MITF (prognostic for melanoma progression); PTEN loss (therapeutic target for PI3K inhibitors).",
    "ACH-000788": "Cell Line: A2058  1. Cell Type and Origin: Human melanoma cell line derived from a lymph node metastasis of cutaneous melanoma (Skin Cancer).  2. Molecular Signatures:  - Mutations: High-frequency mutations in BRAF (V600E), CDKN2A loss, and PTEN alterations.  - Protein expression: Overexpression of MITF, S100, and melanoma-associated antigens (e.g., MART-1).  3. Signaling Pathways:  - Hyperactivated MAPK/ERK pathway due to BRAF V600E mutation.  - Dysregulated PI3K/AKT/mTOR pathway from PTEN loss.  - Elevated Wnt/β-catenin signaling.  4. Known Drug Response Profiles:  - Sensitive to BRAF inhibitors (e.g., vemurafenib, dabrafenib) and MEK inhibitors (e.g., trametinib).  - Resistance observed with monotherapy due to pathway reactivation.  - Susceptible to combined BRAF/MEK inhibition.  5. Cellular Microenvironment:  - Derived from metastatic site (lymph node), suggesting adaptive survival mechanisms.  - Limited data on extracellular matrix composition but exhibits invasive properties.  - Low immune infiltration in vitro (immune-evasion phenotype).  6. Key Biomarkers:  - BRAF V600E as a primary therapeutic target.  - PTEN loss as a resistance marker.  - MITF expression linked to melanoma progression.",
    "ACH-000147": "Cell Line: T-47D (DepMap ID: ACH-000147)  1. Cell Type and Origin:  - Epithelial ductal carcinoma cell line derived from pleural effusion of invasive breast cancer.  2. Molecular Signatures:  - Hormone receptor-positive (ER+, PR+), HER2-negative.  - Common mutations: PIK3CA (H1047R), GATA3 frameshift, CDH1 loss.  - Overexpresses cyclin D1 (CCND1) and BCL2.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR, ER/PR signaling, JAK/STAT.  - Dysregulated: p53 pathway (mutant TP53).  4. Known Drug Response Profiles:  - Sensitive: Tamoxifen, fulvestrant (ER antagonists), PI3K/mTOR inhibitors (e.g., alpelisib, everolimus).  - Resistant: Chemotherapeutics (e.g., paclitaxel) in absence of targeted therapy.  5. Cellular Microenvironment:  - Minimal native immune cell presence (in vitro model).  - Grows in adherent monolayers; extracellular matrix interactions studied via collagen/Matrigel assays.  6. Key Biomarkers:  - Prognostic: ER/PR status (predicts endocrine therapy response).  - Therapeutic targets: ER, PR, PI3K, cyclin D1.",
    "ACH-000651": "1. Cell type and origin: SW-620 is a human colorectal adenocarcinoma cell line derived from a lymph node metastasis of a colon cancer patient.  2. Molecular signatures:  - Common mutations: APC, TP53, KRAS (G12V), and PIK3CA (E545K).  - Microsatellite stable (MSS) with chromosomal instability.  - Overexpression of EGFR and HER2.  3. Signaling pathways:  - Hyperactivated MAPK/ERK and PI3K/AKT pathways due to KRAS and PIK3CA mutations.  - Wnt/β-catenin dysregulation from APC loss.  - Elevated NF-κB signaling.  4. Known drug response profiles:  - Resistant to EGFR inhibitors (e.g., cetuximab) due to KRAS mutation.  - Sensitive to MEK inhibitors (e.g., trametinib) and PI3K inhibitors (e.g., alpelisib).  - Moderate sensitivity to 5-FU and oxaliplatin.  5. Cellular microenvironment:  - Derived from metastatic site (lymph node), suggesting adaptive survival mechanisms.  - Limited native immune cell presence in vitro.  6. Key biomarkers:  - KRAS G12V (predictive of EGFR inhibitor resistance).  - High c-MYC expression (prognostic for aggressive growth).  - CD44 and CD133 (markers of potential cancer stemness).",
    "ACH-000810": "Cell Line: SKMEL30  1. Cell Type and Origin: Melanoma cell line derived from skin; primary disease is cutaneous melanoma.  2. Molecular Signatures:  - Mutations: BRAF V600E (common driver mutation), CDKN2A loss, PTEN deletion.  - Protein expression: High MITF (melanocyte lineage marker), moderate PD-L1.  3. Signaling Pathways:  - Hyperactivated MAPK/ERK pathway (due to BRAF mutation).  - PI3K/AKT pathway dysregulation (PTEN loss).  - Moderate Wnt/β-catenin activity.  4. Known Drug Response Profiles:  - Sensitive to BRAF inhibitors (e.g., vemurafenib, dabrafenib).  - Resistance to MEK inhibitors as monotherapy.  - Moderate sensitivity to immune checkpoint inhibitors (e.g., anti-PD-1).  5. Cellular Microenvironment:  - Limited extracellular matrix interaction in vitro.  - Low endogenous immune cell infiltration (typical for melanoma cell lines).  6. Key Biomarkers:  - BRAF V600E (therapeutic target).  - PD-L1 (potential immune checkpoint target).  - MITF (prognostic marker for melanoma progression).",
    "ACH-000644": "Cell Line: COLO 829  1. Cell Type and Origin: Melanoma cell line derived from skin; primary disease is skin cancer (malignant melanoma).  2. Molecular Signatures:  - Mutations: BRAF V600E (common driver mutation), PTEN loss, CDKN2A deletion.  - Protein expression: High MITF, SOX10; low PTEN.  3. Signaling Pathways:  - Activated: MAPK/ERK (due to BRAF V600E), PI3K/AKT (PTEN loss).  - Inhibited: p53 pathway (CDKN2A deletion).  4. Known Drug Response Profiles:  - Sensitive: BRAF inhibitors (vemurafenib, dabrafenib), MEK inhibitors (trametinib).  - Resistant: Monotherapy with immune checkpoint inhibitors (low PD-L1 expression).  5. Cellular Microenvironment:  - Limited extracellular matrix interaction in vitro; low immune cell infiltration (low MHC-I expression).  6. Key Biomarkers:  - Prognostic: BRAF V600E (predicts response to BRAF/MEK inhibitors).  - Therapeutic targets: BRAF, MEK, PI3K/AKT.",
    "ACH-000348": "Cell Line Description: RPMI7951 (DepMap ID: ACH-000348)  1. Cell Type and Origin:  - Derived from lymph node metastasis of skin cancer (melanoma).  2. Molecular Signatures:  - Common melanoma-associated mutations (e.g., BRAF, NRAS, or PTEN if present).  - Likely expresses melanoma markers (S100, Melan-A/MART-1).  3. Signaling Pathways:  - Hyperactivation of MAPK/ERK pathway (typical in melanoma).  - Potential dysregulation of PI3K/AKT/mTOR pathway.  4. Known Drug Response Profiles:  - Sensitivity to BRAF/MEK inhibitors (if BRAF-mutant).  - Possible resistance to chemotherapy agents (e.g., dacarbazine).  5. Cellular Microenvironment:  - Lymph node origin suggests immune cell interactions (T cells, dendritic cells).  - May exhibit immunosuppressive factors (e.g., PD-L1 expression).  6. Key Biomarkers:  - BRAF V600E (if present, primary therapeutic target).  - CDKN2A loss (prognostic for aggressive melanoma).  - PD-L1 (potential immune checkpoint target).",
    "ACH-000450": "1. Cell type and origin: Mel Ho is a human skin cancer cell line derived from a primary skin tumor. It is associated with cutaneous melanoma, an aggressive form of skin cancer.  2. Molecular signatures: Harbors common melanoma-associated mutations, including BRAF V600E (driver mutation) and likely NRAS or NF1 alterations. Overexpresses MITF and SOX10, typical of melanocytic lineage.  3. Signaling pathways: Hyperactivated MAPK/ERK pathway due to BRAF V600E. Potential PI3K/AKT/mTOR pathway activation. Possible immune evasion via PD-L1 upregulation.  4. Known drug response profiles: Sensitive to BRAF inhibitors (e.g., vemurafenib) and MEK inhibitors (e.g., trametinib). May develop resistance via MAPK pathway reactivation or alternative signaling.  5. Cellular microenvironment: Exhibits autocrine/paracrine signaling typical of melanoma. Limited data on immune cell infiltration, but likely low in vitro. ECM interaction may involve integrin-mediated adhesion.  6. Key biomarkers: BRAF V600E as primary therapeutic target. S100B and MART-1 as melanocytic markers. PD-L1 as potential immune checkpoint marker.",
    "ACH-000968": "Cell Line: COLO 792  1. Cell Type and Origin: Melanoma cell line derived from the central nervous system metastasis of a skin cancer (melanoma) patient.  2. Molecular Signatures: Likely harbors melanoma-associated mutations (e.g., BRAF, NRAS, or NF1). Potential overexpression of MITF and melanocyte differentiation markers (e.g., S100, Melan-A).  3. Signaling Pathways: Hyperactivation of MAPK/ERK pathway (common in melanoma). Possible involvement of PI3K/AKT and Wnt/β-catenin pathways.  4. Known Drug Response Profiles: Likely sensitive to BRAF/MEK inhibitors (e.g., vemurafenib, dabrafenib/trametinib) if BRAF-mutant. Potential resistance to immunotherapy (e.g., anti-PD-1) due to CNS tropism.  5. Cellular Microenvironment: Adapted to CNS metastatic niche; may exhibit interactions with neural/glial cells. Low immune infiltration due to blood-brain barrier evasion.  6. Key Biomarkers: BRAF mutation status (critical for targeted therapy). Elevated S100B or LDH as metastatic progression markers. Potential PD-L1 expression (checkpoint inhibitor relevance).",
    "ACH-000552": "1. Cell type and origin: HT29 is a human colorectal adenocarcinoma cell line derived from the large intestine.  2. Molecular signatures:  - Common mutations: APC (inactivated), TP53 (mutated), KRAS (wild-type), BRAF (wild-type).  - Overexpresses EGFR, HER2, and COX-2.  - Microsatellite stable (MSS).  3. Signaling pathways:  - Activated: Wnt/β-catenin (due to APC loss), PI3K/AKT (EGFR-driven), MAPK (basal activity).  - Inhibited: TGF-β signaling (often disrupted in colorectal cancer).  4. Known drug response profiles:  - Sensitive to EGFR inhibitors (e.g., cetuximab), 5-FU, and irinotecan.  - Resistant to BRAF inhibitors (due to wild-type BRAF).  5. Cellular microenvironment:  - Forms tight junctions and polarized monolayers in vitro.  - Low immune cell infiltration in standard culture conditions.  6. Key biomarkers:  - Prognostic: High COX-2 expression linked to poor prognosis.  - Therapeutic targets: EGFR, HER2, and PI3K/AKT pathway components.",
    "ACH-000900": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from lung tissue.  2. Molecular signatures: Harbors KRAS G12C mutation; expresses EGFR, MET, and TP53 mutations. Moderate PD-L1 expression.  3. Signaling pathways: Hyperactivated MAPK/ERK and PI3K/AKT pathways due to KRAS mutation; mTOR pathway dysregulation.  4. Known drug response profiles: Sensitive to KRAS G12C inhibitors (e.g., sotorasib); resistant to conventional EGFR inhibitors.  5. Cellular microenvironment: Low immune cell infiltration in vitro; secretes pro-inflammatory cytokines (e.g., IL-6, IL-8).  6. Key biomarkers: KRAS G12C (targetable), PD-L1 (immunotherapy marker), MET amplification (resistance marker).",
    "ACH-000971": "1. Cell type and origin: HCT116 is a human colorectal carcinoma cell line derived from the large intestine, widely used as a model for colon/colorectal cancer.  2. Molecular signatures:  - Common mutations: KRAS (G13D), PIK3CA (H1047R), TP53 (R248W), and CTNNB1 (S45F).  - Mismatch repair-deficient (MMR-D) due to MLH1 promoter methylation.  - High expression of β-catenin and cyclin D1.  3. Signaling pathways:  - Hyperactivated Wnt/β-catenin signaling due to CTNNB1 mutation.  - Constitutive MAPK/ERK activation via mutant KRAS.  - PI3K/AKT/mTOR pathway dysregulation from PIK3CA mutation.  - p53 pathway inactivation.  4. Known drug response profiles:  - Sensitive to MEK inhibitors (e.g., trametinib) but resistant to EGFR inhibitors (e.g., cetuximab) due to KRAS mutation.  - Responsive to PARP inhibitors (e.g., olaparib) owing to DNA repair defects.  - Resistance to 5-FU modulated by MMR-D status.  5. Cellular microenvironment:  - Typically cultured in 2D monolayers; limited native extracellular matrix or immune cell interactions in vitro.  - Xenograft models show moderate stromal infiltration.  6. Key biomarkers:  - Prognostic: MMR-D status, KRAS mutation.  - Therapeutic targets: MEK, PARP, PI3K, Wnt/β-catenin.",
    "ACH-000572": "Cell Line Description: G-361 (DepMap ID: ACH-000572)  1. Cell Type and Origin: Melanoma cell line derived from skin; primary disease: Skin Cancer (malignant melanoma).  2. Molecular Signatures:  - Mutations: BRAF V600E (common driver mutation), PTEN loss, CDKN2A deletion.  - Protein expression: High MITF, SOX10; variable MAPK/ERK pathway activation.  3. Signaling Pathways:  - Activated: MAPK/ERK (due to BRAF V600E), PI3K/AKT (PTEN loss).  - Inhibited: p53 pathway (often dysfunctional in melanoma).  4. Known Drug Response Profiles:  - Sensitive: BRAF inhibitors (vemurafenib, dabrafenib), MEK inhibitors (trametinib).  - Resistant: Monotherapy with immune checkpoint inhibitors (low PD-L1 expression).  5. Cellular Microenvironment:  - Limited extracellular matrix interaction in vitro; low immune cell infiltration (models aggressive, immune-evasive melanoma).  6. Key Biomarkers:  - Prognostic: BRAF V600E status, PTEN loss.  - Therapeutic targets: BRAF, MEK, MITF.",
    "ACH-000811": "1. Cell type and origin: Epithelial ovarian adenocarcinoma, derived from ascites.  2. Molecular signatures: TP53 mutation (common), PTEN loss, HER2/neu amplification; low BRCA1/2 expression.  3. Signaling pathways: Hyperactivated PI3K/AKT/mTOR pathway; dysregulated Wnt/β-catenin; defective homologous recombination (HR).  4. Known drug response profiles: Resistant to platinum-based chemotherapy; sensitive to PARP inhibitors (e.g., olaparib) due to HR deficiency; EGFR/HER2-targeted therapy potential.  5. Cellular microenvironment: Ascites-derived; high lactate secretion (hypoxic); minimal immune infiltration (low PD-L1).  6. Key biomarkers: CA-125 (elevated); HER2/neu (potential target); HRD score (predicts PARPi response).",
    "ACH-000401": "1. Cell type and origin: Epithelial cell line derived from metastatic skin melanoma (Skin Cancer).  2. Molecular signatures: Harbors mutations in BRAF (V600E), NRAS, and TP53; overexpresses MITF and SOX10.  3. Signaling pathways: Hyperactivated MAPK/ERK pathway (BRAF-driven); dysregulated PI3K/AKT/mTOR pathway.  4. Known drug response profiles: Sensitive to BRAF inhibitors (vemurafenib, dabrafenib); resistant to monotherapy MEK inhibitors.  5. Cellular microenvironment: Low immune cell infiltration; ECM rich in fibronectin and collagen.  6. Key biomarkers: BRAF V600E (therapeutic target); elevated S100B (prognostic marker).",
    "ACH-000463": "Cell Line: NCI-H460  1. Cell Type and Origin: Non-small cell lung cancer (NSCLC) cell line derived from a pleural effusion of a patient with large cell lung carcinoma.  2. Molecular Signatures:  - Mutations: KRAS (G12V), STK11 (LOH), TP53 (R273H).  - Protein overexpression: EGFR (low), MET (moderate), PD-L1 (variable).  3. Signaling Pathways:  - Activated: RAS/RAF/MEK/ERK, PI3K/AKT/mTOR.  - Inhibited: LKB1/AMPK (due to STK11 loss).  4. Known Drug Response Profiles:  - Sensitive to MEK inhibitors (e.g., trametinib), taxanes (e.g., paclitaxel).  - Resistant to EGFR inhibitors (e.g., erlotinib).  5. Cellular Microenvironment:  - Minimal extracellular matrix interaction in vitro; lacks significant immune cell presence in standard culture.  6. Key Biomarkers:  - Prognostic: KRAS mutation (associated with aggressive phenotype).  - Therapeutic targets: MET, MEK, PD-L1 (context-dependent).",
    "ACH-000614": "Cell Line: RVH-421 (DepMap ID: ACH-000614)  1. Cell Type and Origin: Derived from central nervous system metastasis of skin cancer (likely melanoma).  2. Molecular Signatures:  - Common melanoma-associated mutations (e.g., BRAF V600E, NRAS, or PTEN alterations).  - Potential overexpression of MITF or other melanocytic differentiation markers.  3. Signaling Pathways:  - Hyperactivated MAPK/ERK pathway (typical of BRAF-mutant melanomas).  - Possible PI3K/AKT/mTOR pathway activation due to PTEN loss or NRAS mutations.  4. Known Drug Response Profiles:  - Sensitivity to BRAF/MEK inhibitors (e.g., vemurafenib + trametinib) if BRAF-mutant.  - Potential resistance to immunotherapy (e.g., anti-PD-1) due to CNS immune privilege.  5. Cellular Microenvironment:  - CNS tropism suggests adaptation to neural tissue extracellular matrix (e.g., high laminin, fibronectin).  - Limited immune infiltrate (low T-cell presence typical of CNS metastases).  6. Key Biomarkers:  - BRAF mutation status (critical for targeted therapy).  - SOX10 or S100B as melanocytic lineage markers.  - PD-L1 expression (if applicable for immune checkpoint response).",
    "ACH-000008": "### Cell Line Description: A101D (DepMap ID: ACH-000008)  1. Cell Type and Origin  - Derived from skin, classified as a skin cancer cell line.  2. Molecular Signatures  - Common mutations in skin cancer-related genes (e.g., BRAF, NRAS, TP53).  - Possible dysregulation in proliferation and survival markers.  3. Signaling Pathways  - Likely activation of MAPK/ERK pathway (common in skin cancers).  - Potential alterations in PI3K/AKT/mTOR signaling.  4. Known Drug Response Profiles  - Expected sensitivity to BRAF/MEK inhibitors (e.g., vemurafenib, trametinib).  - Possible resistance to chemotherapeutics (e.g., cisplatin, dacarbazine).  5. Cellular Microenvironment  - Limited immune infiltration (typical for in vitro models).  - Extracellular matrix interactions may involve integrins and MMPs.  6. Key Biomarkers  - BRAF V600E (if present, a major therapeutic target).  - PD-L1 expression (potential immune checkpoint relevance).  - Ki-67 (high proliferation index).",
    "ACH-000019": "1. Cell type and origin: Epithelial cell line derived from pleural effusion of metastatic breast adenocarcinoma (luminal A subtype).  2. Molecular signatures:  - Mutations: PIK3CA (H1047R), TP53 (Y220C), ESR1 amplification.  - Protein expression: ERα+, PR+, HER2-.  3. Signaling pathways:  - Hyperactivated PI3K/AKT/mTOR pathway.  - Estrogen receptor (ER) signaling dominant.  - Moderate MAPK pathway activity.  4. Known drug response profiles:  - Sensitive to tamoxifen, fulvestrant (anti-estrogens), and PI3K/mTOR inhibitors.  - Resistant to HER2-targeted therapies (e.g., trastuzumab).  5. Cellular microenvironment:  - Minimal native immune cell presence in vitro.  - Grows adherently without requirement for specialized extracellular matrix.  6. Key biomarkers:  - ERα (ESR1) as primary therapeutic target.  - PIK3CA mutation as a predictor of PI3K inhibitor response.  - Ki-67 (high) as a proliferation marker.",
    "ACH-000001": "1. Cell type and origin: Epithelial ovarian cancer cell line derived from ascites of a patient with progressive adenocarcinoma of the ovary.  2. Molecular signatures:  - Mutations: TP53 (R248Q), PIK3CA (E545K), KRAS (G12V).  - Overexpression: HER2, EGFR, CA-125.  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR, RAS/RAF/MEK/ERK.  - Inhibited: p53-mediated apoptosis.  4. Known drug response profiles:  - Sensitive: Platinum-based agents (cisplatin, carboplatin), PARP inhibitors (olaparib).  - Resistant: Paclitaxel (due to P-gp overexpression).  5. Cellular microenvironment:  - Extracellular matrix: High fibronectin and collagen secretion.  - Immune cell presence: Low tumor-infiltrating lymphocytes (immune-cold phenotype).  6. Key biomarkers:  - Prognostic: High CA-125 levels.  - Therapeutic targets: HER2, EGFR, PARP.",
    "ACH-000849": "1. Cell type and origin: Triple-negative breast cancer (TNBC) cell line derived from pleural effusion of a metastatic breast adenocarcinoma patient.  2. Molecular signatures:  - Mutations: TP53 (R273H), PTEN loss, EGFR amplification.  - Protein expression: High EGFR, low HER2, ER/PR-negative.  3. Signaling pathways:  - Hyperactivated PI3K/AKT/mTOR due to PTEN loss.  - EGFR-driven MAPK/ERK signaling.  - Impaired DNA damage response (TP53 mutation).  4. Known drug response profiles:  - Sensitive to EGFR inhibitors (e.g., cetuximab, gefitinib).  - Resistant to endocrine therapies (ER/PR-negative).  - Variable response to PARP inhibitors (TP53-dependent).  5. Cellular microenvironment:  - Derived from metastatic site (pleural effusion), suggesting adaptation to fluid-phase ECM.  - Limited immune cell interaction in vitro.  6. Key biomarkers:  - EGFR (therapeutic target).  - PTEN loss (predictor of PI3K inhibitor sensitivity).  - TP53 mutation (prognostic for aggressive phenotype).",
    "ACH-000304": "Cell Line: WM115 (DepMap ID: ACH-000304)  1. Cell Type and Origin: Melanoma cell line derived from primary skin tumor (Skin Cancer).  2. Molecular Signatures:  - Mutations: BRAF V600E (common driver mutation), CDKN2A loss, PTEN mutations.  - Protein expression: High MITF, SOX10; variable MAPK pathway protein levels.  3. Signaling Pathways:  - Hyperactivated MAPK/ERK pathway (BRAF-driven).  - PI3K/AKT pathway dysregulation (PTEN loss).  - Cell cycle disruption (CDKN2A loss).  4. Known Drug Response Profiles:  - Sensitive to BRAF inhibitors (e.g., vemurafenib, dabrafenib).  - Resistance to monotherapy due to adaptive MAPK reactivation.  - Enhanced response to BRAF/MEK inhibitor combinations.  5. Cellular Microenvironment:  - Limited data on native ECM composition; typically cultured in standard 2D conditions.  - Low immune cell infiltration in vitro (immune-evasion phenotype).  6. Key Biomarkers:  - BRAF V600E (diagnostic/therapeutic target).  - PTEN status (predicts PI3K/AKT inhibitor sensitivity).  - MITF levels (prognostic for differentiation state).",
    "ACH-000219": "1. Cell type and origin:  - Melanoma cell line derived from malignant melanoma of the skin.  2. Molecular signatures:  - Harbors activating mutations in BRAF (V600E) and NRAS (Q61K).  - Overexpresses MITF and SOX10, key melanocytic transcription factors.  - Frequent copy number alterations in CDKN2A (loss) and CCND1 (gain).  3. Signaling pathways:  - Hyperactivated MAPK/ERK pathway due to BRAF mutation.  - Dysregulated PI3K/AKT pathway via NRAS and PTEN alterations.  - Elevated WNT/β-catenin signaling linked to invasiveness.  4. Known drug response profiles:  - Sensitive to BRAF inhibitors (vemurafenib, dabrafenib) and MEK inhibitors (trametinib).  - Resistance mechanisms include MAPK pathway reactivation and EGFR upregulation.  - Vulnerable to CDK4/6 inhibitors due to CCND1 amplification.  5. Cellular microenvironment:  - Low immune infiltration in vitro; lacks significant stromal or immune cell interactions.  - Secretes pro-inflammatory cytokines (e.g., IL-6, IL-8), influencing paracrine signaling.  6. Key biomarkers:  - BRAF V600E: Primary therapeutic target.  - PD-L1: Modest expression, potential immune checkpoint relevance.  - AXL: Associated with drug resistance and metastatic potential.",
    "ACH-000555": "1. Cell type and origin: A498 is a human renal cell carcinoma (RCC) cell line derived from a kidney tumor, representing clear cell RCC (ccRCC), the most common subtype of kidney cancer.  2. Molecular signatures:  - Mutations: Frequently harbors VHL (von Hippel-Lindau) gene inactivation, leading to HIF-α stabilization.  - Copy number alterations: Common losses in 3p (containing VHL, PBRM1) and gains in 5q.  - Protein expression: Overexpresses CAIX (carbonic anhydrase IX) and VEGF, typical of ccRCC.  3. Signaling pathways:  - Activated: HIF/VEGF (angiogenesis), mTOR, and PI3K/AKT pathways due to VHL loss.  - Inhibited: Oxygen-sensing pathway (pVHL-dependent degradation of HIF).  4. Known drug response profiles:  - Sensitive: mTOR inhibitors (e.g., everolimus), VEGF-targeted therapies (e.g., sunitinib).  - Resistant: Conventional chemotherapy (e.g., cisplatin).  5. Cellular microenvironment:  - Extracellular matrix: High fibronectin and collagen deposition.  - Immune cell presence: Low tumor-infiltrating lymphocytes (TILs), indicative of an immune-excluded phenotype.  6. Key biomarkers:  - Prognostic: VHL mutation status, HIF-α levels.  - Therapeutic targets: VEGF, PD-L1 (moderate expression), CAIX.",
    "ACH-000915": "### IPC-298 Cell Line Description (DepMap ID: ACH-000915)  1. Cell Type and Origin  - Melanoma cell line derived from skin.  - Primary disease: Skin cancer (melanoma).  2. Molecular Signatures  - Common melanoma-associated mutations (e.g., BRAF, NRAS, NF1).  - Potential dysregulation in tumor suppressor genes (TP53, CDKN2A).  - Overexpression of melanoma markers (e.g., S100, Melan-A).  3. Signaling Pathways  - Hyperactivation of MAPK/ERK pathway (e.g., via BRAF mutation).  - PI3K/AKT/mTOR pathway dysregulation.  - Potential immune evasion mechanisms (e.g., PD-L1 expression).  4. Known Drug Response Profiles  - Sensitivity to BRAF/MEK inhibitors (if BRAF-mutant).  - Possible resistance to immunotherapy (e.g., anti-PD-1).  - Chemotherapy resistance (e.g., dacarbazine).  5. Cellular Microenvironment  - Limited immune infiltration (low T-cell presence in vitro).  - ECM interaction via integrins and matrix metalloproteinases.  6. Key Biomarkers  - Prognostic: BRAF mutation status, MITF expression.  - Therapeutic targets: BRAF, MEK, PD-L1, CDK4/6.",
    "ACH-000288": "1. Cell type and origin: BT-549 is a triple-negative breast cancer (TNBC) cell line derived from invasive ductal carcinoma of the breast.  2. Molecular signatures:  - Genetic mutations: TP53 (mutated), PIK3CA (wild-type), PTEN (deleted).  - Protein expression: Low ER, PR, and HER2; high EGFR and Vimentin (epithelial-mesenchymal transition marker).  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR (due to PTEN loss), MAPK/ERK, Wnt/β-catenin.  - Inhibited: Hormone receptor pathways (ER/PR).  4. Known drug response profiles:  - Sensitive: PARP inhibitors (due to DNA repair deficiencies), EGFR inhibitors.  - Resistant: Endocrine therapies (e.g., tamoxifen, aromatase inhibitors).  5. Cellular microenvironment:  - Extracellular matrix: High fibronectin and collagen I (mesenchymal phenotype).  - Immune cell presence: Low tumor-infiltrating lymphocytes (immune-cold phenotype).  6. Key biomarkers:  - Prognostic markers: High Vimentin (poor prognosis).  - Therapeutic targets: EGFR, PARP, PI3K/AKT/mTOR.",
    "ACH-000148": "1. Cell type and origin: Epithelial cell line derived from human breast carcinoma (triple-negative breast cancer, TNBC).  2. Molecular signatures:  - Mutations: TP53 (R196), PIK3CA (H1047R), PTEN loss.  - Overexpression: EGFR, Vimentin (mesenchymal marker).  - Hormone receptor-negative (ER-, PR-, HER2-).  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR (due to PIK3CA mutation), MAPK/ERK.  - Impaired: p53 pathway (TP53 truncation).  4. Known drug response profiles:  - Sensitive: EGFR inhibitors (e.g., gefitinib), PI3K/mTOR inhibitors.  - Resistant: Endocrine therapies (tamoxifen, aromatase inhibitors).  5. Cellular microenvironment:  - Mesenchymal-like phenotype (high vimentin, low E-cadherin).  - Low immune infiltration in vitro; lacks significant stromal components.  6. Key biomarkers:  - Prognostic: TP53 mutation, PTEN loss.  - Therapeutic targets: EGFR, PI3K/AKT/mTOR.",
    "ACH-000367": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from a pleural effusion.  2. Molecular signatures: Common mutations include TP53 and CDKN2A loss; KRAS mutations may be present. Overexpression of EGFR and MET reported.  3. Signaling pathways: RAS/RAF/MEK/ERK pathway activation; PI3K/AKT/mTOR dysregulation; potential Wnt/β-catenin involvement.  4. Known drug response profiles: Sensitivity to MET inhibitors (e.g., crizotinib); resistance to EGFR TKIs (e.g., erlotinib) unless EGFR mutations are present.  5. Cellular microenvironment: Derived from pleural effusion, suggesting exposure to inflammatory cytokines; limited extracellular matrix interaction in vitro.  6. Key biomarkers: MET amplification (potential target); TP53 mutation (prognostic); PD-L1 expression (immune checkpoint relevance).",
    "ACH-000376": "1. Cell type and origin: SF-295 is a human glioblastoma cell line derived from the central nervous system, representing an aggressive form of brain cancer.  2. Molecular signatures: Harbors mutations in TP53, PTEN, and NF1, with overexpression of EGFR and PDGFRA. Exhibits high genomic instability and amplification of MYC.  3. Signaling pathways: Hyperactivation of PI3K/AKT/mTOR and RAS/RAF/MEK/ERK pathways due to PTEN loss and NF1 mutations. Upregulated Wnt/β-catenin signaling contributes to proliferation.  4. Known drug response profiles: Sensitive to PI3K/AKT/mTOR inhibitors (e.g., everolimus) and EGFR inhibitors (e.g., erlotinib). Resistant to temozolomide and conventional chemotherapies.  5. Cellular microenvironment: Lacks significant immune cell infiltration but secretes high levels of TGF-β and IL-10, contributing to an immunosuppressive niche. Extracellular matrix remodeling involves fibronectin and laminin overexpression.  6. Key biomarkers: EGFR amplification (therapeutic target), MGMT promoter methylation (prognostic for alkylator resistance), and high VEGF expression (angiogenesis marker).",
    "ACH-000681": "1. Cell type and origin: Epithelial cell line derived from lung adenocarcinoma.  2. Molecular signatures:  - Mutations: KRAS (G12S), TP53 (R158L), STK11 (loss).  - Protein expression: High EGFR, moderate PD-L1, low HER2.  3. Signaling pathways:  - Activated: RAS/RAF/MEK/ERK, PI3K/AKT/mTOR.  - Inhibited: LKB1/AMPK (due to STK11 loss).  4. Known drug response profiles:  - Sensitive: EGFR inhibitors (e.g., erlotinib), MEK inhibitors (e.g., trametinib).  - Resistant: Single-agent chemotherapy (e.g., cisplatin).  5. Cellular microenvironment:  - Extracellular matrix: High collagen and fibronectin deposition.  - Immune cell presence: Low tumor-infiltrating lymphocytes (TILs).  6. Key biomarkers:  - Prognostic: KRAS mutation status.  - Therapeutic targets: EGFR, PD-L1.",
    "ACH-000987": "1. Cell type and origin: Melanoma cell line derived from metastatic lymph node tissue in a skin cancer (melanoma) patient.  2. Molecular signatures:  - Common melanoma-associated mutations (e.g., BRAF, NRAS, TP53).  - High expression of melanoma markers (e.g., S100, Melan-A).  3. Signaling pathways:  - Hyperactivated MAPK/ERK pathway (common in melanoma).  - Potential PI3K/AKT pathway activation.  - Possible immune evasion mechanisms (e.g., PD-L1 expression).  4. Known drug response profiles:  - Sensitivity to BRAF/MEK inhibitors (if BRAF-mutant).  - Resistance to chemotherapy (e.g., dacarbazine) in some contexts.  - Variable response to immunotherapies (e.g., anti-PD-1).  5. Cellular microenvironment:  - Lymph node metastatic origin suggests adaptive immune interactions.  - May exhibit extracellular matrix remodeling (e.g., MMP overexpression).  6. Key biomarkers:  - Prognostic: BRAF mutation status, MITF expression.  - Therapeutic targets: BRAF, MEK, PD-1/PD-L1, CDK4/6.",
    "ACH-000046": "1. Cell type and origin: ACHN is a human renal cell adenocarcinoma cell line derived from a pleural effusion.  2. Molecular signatures:  - Mutations in VHL (common in kidney cancer), SETD2, and PTEN.  - Overexpression of CAIX (carbonic anhydrase IX) and PD-L1.  3. Signaling pathways:  - Hypoxia-inducible factor (HIF) pathway activation due to VHL loss.  - PI3K/AKT/mTOR pathway dysregulation.  - Increased VEGF signaling promoting angiogenesis.  4. Known drug response profiles:  - Sensitive to mTOR inhibitors (e.g., everolimus).  - Resistant to conventional chemotherapy (e.g., cisplatin).  - Responsive to anti-angiogenic agents (e.g., sunitinib).  5. Cellular microenvironment:  - Derived from metastatic site (pleural effusion), suggesting adaptation to fluid-phase growth.  - Limited data on extracellular matrix composition; likely low immune cell infiltration.  6. Key biomarkers:  - VHL mutation status (predicts HIF-targeted therapy response).  - CAIX (hypoxia marker and therapeutic target).  - PD-L1 (potential immune checkpoint inhibitor target).",
    "ACH-000997": "Cell Line: HCT-15  1. Cell Type and Origin: Colorectal adenocarcinoma cell line derived from the large intestine. Primary disease: Colon/Colorectal Cancer.  2. Molecular Signatures:  - Mutations: APC (truncating), TP53 (missense), KRAS (G13D), PIK3CA (E545K).  - Microsatellite instability (MSI) due to MLH1 methylation.  - Overexpression of EGFR and HER2.  3. Signaling Pathways:  - Hyperactivated MAPK/ERK (KRAS-driven) and PI3K/AKT pathways.  - Wnt/β-catenin dysregulation (APC mutation).  - Impaired DNA mismatch repair (MMR) pathway.  4. Known Drug Response Profiles:  - Resistant to 5-FU and oxaliplatin (common CRC chemotherapies).  - Sensitive to EGFR inhibitors (e.g., cetuximab) in KRAS wild-type contexts (but HCT-15 is KRAS-mutant).  - Vulnerable to PARP inhibitors due to DNA repair defects.  5. Cellular Microenvironment:  - Limited data on native ECM composition; typically cultured in standard monolayers.  - Low immune cell infiltration in vitro; lacks significant PD-L1 expression.  6. Key Biomarkers:  - Prognostic: KRAS G13D (predicts resistance to anti-EGFR therapy).  - Therapeutic targets: HER2, PI3K, PARP.  - MSI-H status suggests potential response to immune checkpoint inhibitors (e.g., pembrolizumab).",
    "ACH-000768": "1. Cell type and origin: Triple-negative breast cancer (TNBC) cell line derived from pleural effusion of a metastatic adenocarcinoma patient.  2. Molecular signatures:  - Mutations: TP53 (R280K), KRAS (G13D), PIK3CA (wild-type).  - Protein expression: High EGFR, Vimentin (mesenchymal marker); low E-cadherin (epithelial marker).  3. Signaling pathways:  - Activated: RAS/MAPK, PI3K/AKT (moderate), NF-κB.  - Inhibited: ER/PR signaling (hormone receptor-negative).  4. Known drug response profiles:  - Sensitive: Paclitaxel, PARP inhibitors (BRCA-proficient but HRD-like).  - Resistant: Endocrine therapies (e.g., tamoxifen), HER2-targeted agents.  5. Cellular microenvironment:  - Extracellular matrix: High fibronectin/collagen I secretion (pro-fibrotic).  - Immune cell presence: Low tumor-infiltrating lymphocytes (immunologically \"cold\").  6. Key biomarkers:  - Prognostic: High Ki-67 (proliferation), PD-L1 (immune evasion).  - Therapeutic targets: EGFR, MET, VEGFR.",
    "ACH-001151": "Cell Line: OVCAR-5 (DepMap ID: ACH-001151)  1. Cell Type and Origin  - Epithelial ovarian cancer cell line derived from ascites.  - Primary disease: High-grade serous ovarian cancer (HGSOC).  2. Molecular Signatures  - Mutations: TP53 (common in HGSOC), BRCA1/2 wild-type.  - Overexpression: HER2, EGFR, CA-125 (MUC16).  3. Signaling Pathways  - Activated: PI3K/AKT/mTOR, RAS/RAF/MEK/ERK.  - Dysregulated: DNA repair pathways (e.g., homologous recombination).  4. Known Drug Response Profiles  - Sensitive: Platinum-based chemotherapies (e.g., cisplatin), PARP inhibitors (moderate).  - Resistant: Taxanes (e.g., paclitaxel) in some contexts.  5. Cellular Microenvironment  - Derived from ascites, suggesting exposure to fluid-phase cytokines/growth factors.  - Limited native immune cell presence in vitro.  6. Key Biomarkers  - Prognostic: CA-125 (MUC16) secretion.  - Therapeutic targets: HER2, EGFR, PI3K/AKT/mTOR.",
    "ACH-000655": "SF-268 Cell Line Description for Synergy Prediction  1. Cell Type and Origin: Derived from a glioblastoma (brain cancer) of the central nervous system.  2. Molecular Signatures:  - Mutations in TP53, PTEN, and PIK3CA.  - Overexpression of EGFR and PDGFR.  3. Signaling Pathways:  - Hyperactivated PI3K/AKT/mTOR pathway.  - Dysregulated MAPK/ERK signaling.  4. Known Drug Response Profiles:  - Sensitive to EGFR inhibitors (e.g., erlotinib).  - Resistant to temozolomide (common glioblastoma chemotherapeutic).  5. Cellular Microenvironment:  - Limited immune cell infiltration (low immunogenicity).  - Extracellular matrix rich in fibronectin and laminin.  6. Key Biomarkers:  - EGFR amplification (therapeutic target).  - High VEGF expression (prognostic for angiogenesis).",
    "ACH-000232": "1. Cell type and origin: Glioblastoma cell line derived from a malignant astrocytoma in the central nervous system.  2. Molecular signatures:  - Homozygous deletion of CDKN2A/CDKN2B; mutations in TP53 (R273L), PTEN (R130), and TERT promoter.  - Overexpression of EGFR (no amplification) and PDGFRA.  3. Signaling pathways:  - Hyperactivated PI3K/AKT/mTOR due to PTEN loss.  - Dysregulated p53 pathway (TP53 mutation).  - Elevated MAPK/ERK signaling.  4. Known drug response profiles:  - Sensitive to EGFR inhibitors (e.g., erlotinib) but develops resistance.  - Resistant to temozolomide (low MGMT expression but mismatch repair proficient).  - Vulnerable to PI3K/mTOR inhibitors (e.g., everolimus).  5. Cellular microenvironment:  - Limited immune cell infiltration (low PD-L1 expression).  - Secretes pro-angiogenic factors (VEGF, IL-8).  6. Key biomarkers:  - Prognostic: PTEN loss, TP53 mutation.  - Therapeutic targets: EGFR, PDGFRA, mTOR.",
    "ACH-000969": "1. Cell type and origin: KM12 is a human colon adenocarcinoma cell line derived from the large intestine, classified as a Colon/Colorectal Cancer model.  2. Molecular signatures: Harbors mutations in KRAS (G12V), TP53, and APC, common in colorectal cancer. Overexpresses EGFR and HER2, with moderate levels of c-MET. Microsatellite stable (MSS).  3. Signaling pathways: Hyperactivation of MAPK/ERK (due to KRAS mutation) and PI3K/AKT pathways. Wnt/β-catenin signaling dysregulated via APC mutation. Moderate EGFR/HER2-driven signaling.  4. Known drug response profiles: Sensitive to EGFR inhibitors (e.g., cetuximab) but resistance develops due to KRAS mutation. Responsive to MEK inhibitors (e.g., trametinib) and multi-kinase inhibitors (e.g., regorafenib). Resistant to 5-FU monotherapy.  5. Cellular microenvironment: Grows in adherent epithelial clusters. Limited data on immune cell infiltration in vitro; exhibits moderate stromal interaction markers (e.g., fibronectin secretion).  6. Key biomarkers: KRAS G12V (predictor of EGFR inhibitor resistance), HER2/EGFR (therapeutic targets), MSI status (MSS), and high TP53 dysfunction (prognostic for aggressiveness).",
    "ACH-000090": "1. Cell type and origin: Prostate adenocarcinoma cell line derived from bone metastasis.  2. Molecular signatures: Homozygous deletion of PTEN; mutations in TP53, RB1; androgen receptor (AR)-negative; high expression of MET, EGFR.  3. Signaling pathways: Hyperactivated PI3K/AKT/mTOR due to PTEN loss; dysregulated cell cycle (RB1 loss); RAS/RAF/MEK/ERK pathway involvement.  4. Known drug response profiles: Resistant to androgen deprivation therapy; sensitive to PI3K/AKT inhibitors (e.g., ipatasertib), PARP inhibitors (e.g., olaparib), and MET inhibitors (e.g., crizotinib).  5. Cellular microenvironment: Mimics osteoblastic bone metastasis; lacks significant immune cell infiltration; secretes osteogenic factors (e.g., BMPs, TGF-β).  6. Key biomarkers: PTEN loss (prognostic); MET, EGFR (therapeutic targets); PSA-negative (diagnostic).",
    "ACH-000966": "Cell Line: IGROV1  1. Cell Type and Origin: Epithelial ovarian cancer cell line derived from a malignant adenocarcinoma of the ovary.  2. Molecular Signatures:  - Mutations: TP53 (common in ovarian cancer), PIK3CA, and PTEN alterations.  - Overexpression: HER2, EGFR, and topoisomerase II.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR, MAPK/ERK, and EGFR/HER2 pathways.  - Dysregulated: DNA repair pathways (e.g., homologous recombination deficiency).  4. Known Drug Response Profiles:  - Sensitive: Platinum-based agents (cisplatin), PARP inhibitors (olaparib), and topoisomerase inhibitors.  - Resistant: Taxanes (paclitaxel) in some studies.  5. Cellular Microenvironment:  - Limited extracellular matrix interaction in vitro; lacks significant immune cell infiltration in standard culture.  6. Key Biomarkers:  - Prognostic: TP53 mutation status, BRCA1/2 deficiency (if present).  - Therapeutic targets: HER2, EGFR, PARP (for synthetic lethality approaches).",
    "ACH-000343": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from a lung adenocarcinoma.  2. Molecular signatures: Harbors mutations in KRAS (G12C), TP53, and STK11; exhibits high expression of TTF-1 (NKX2-1) and low expression of PD-L1.  3. Signaling pathways: Hyperactivated RAS/MAPK and PI3K/AKT pathways due to KRAS mutation; mTOR pathway dysregulation from STK11 loss.  4. Known drug response profiles: Sensitive to MEK inhibitors (e.g., trametinib) and resistant to EGFR inhibitors (e.g., gefitinib).  5. Cellular microenvironment: Minimal stromal contamination; lacks significant immune cell infiltration in vitro.  6. Key biomarkers: KRAS G12C (therapeutic target), TTF-1 (diagnostic marker), low PD-L1 (predictive of poor immunotherapy response).",
    "ACH-000696": "Cell Line: OVCAR-8  1. Cell Type and Origin: Epithelial ovarian cancer cell line derived from the ovary; model for high-grade serous ovarian adenocarcinoma.  2. Molecular Signatures:  - Mutations: TP53 (common in ovarian cancer), BRCA1/2 wild-type.  - Copy number alterations: Amplifications in CCNE1, MYC; deletions in PTEN.  - Protein expression: Overexpression of HER2, EGFR; moderate PD-L1 expression.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR, RAS/RAF/MEK/ERK, Wnt/β-catenin.  - Inhibited: p53-mediated apoptosis due to TP53 mutation.  4. Known Drug Response Profiles:  - Sensitive: Platinum-based agents (cisplatin, carboplatin), PARP inhibitors (olaparib resistance observed in BRCA wild-type).  - Resistant: Paclitaxel (moderate resistance), MEK inhibitors (selumetinib).  5. Cellular Microenvironment:  - Extracellular matrix: High fibronectin and collagen deposition.  - Immune cell presence: Low tumor-infiltrating lymphocytes (TILs); immunosuppressive markers (e.g., TGF-β).  6. Key Biomarkers:  - Prognostic: CA-125 (elevated), HE4 (human epididymis protein 4).  - Therapeutic targets: HER2, EGFR, PD-L1, CCNE1.",
    "ACH-000273": "### SF-539 Cell Line Description (DepMap ID: ACH-000273)  1. Cell Type and Origin:  - Derived from a glioblastoma (brain cancer) patient.  - Tissue source: Central nervous system.  2. Molecular Signatures:  - Common glioblastoma-associated mutations (e.g., TP53, PTEN loss, EGFR amplification).  - Overexpression of oncogenic proteins (e.g., PDGFR, VEGF receptors).  3. Signaling Pathways:  - Hyperactivated PI3K/AKT/mTOR pathway.  - Dysregulated RTK/RAS/MAPK signaling.  - Impaired apoptosis due to Bcl-2 family protein alterations.  4. Known Drug Response Profiles:  - Sensitive to RTK inhibitors (e.g., erlotinib, sunitinib).  - Resistant to conventional alkylating agents (e.g., temozolomide).  - Responsive to PI3K/mTOR pathway inhibitors.  5. Cellular Microenvironment:  - Exhibits invasive growth in extracellular matrix (ECM)-rich conditions.  - Low immune cell infiltration (immunologically \"cold\" tumor model).  6. Key Biomarkers:  - Prognostic: High EGFR amplification, MGMT promoter methylation status.  - Therapeutic targets: PDGFR, VEGF, mTOR.",
    "ACH-000649": "1. Cell type and origin: Renal cell carcinoma (RCC) derived from kidney tissue.  2. Molecular signatures: Harbors VHL mutation (common in RCC), TP53 mutation, and overexpression of CAIX (carbonic anhydrase IX).  3. Signaling pathways: Hypoxia-inducible factor (HIF) pathway activation due to VHL loss; PI3K/AKT/mTOR pathway dysregulation.  4. Known drug response profiles: Sensitive to mTOR inhibitors (e.g., everolimus); resistant to conventional chemotherapy.  5. Cellular microenvironment: Low immune cell infiltration; exhibits angiogenic properties due to VEGF secretion.  6. Key biomarkers: VHL (prognostic), CAIX (diagnostic/therapeutic target), PD-L1 (potential immune checkpoint relevance).",
    "ACH-000477": "Cell Line Description: MALME-3M (DepMap ID: ACH-000477)  1. Cell Type and Origin: Metastatic melanoma cell line derived from a lung metastasis of skin cancer (primary disease: cutaneous melanoma).  2. Molecular Signatures:  - Common melanoma-associated mutations (e.g., BRAF, NRAS, or NF1; verify specific mutations in DepMap).  - Likely expresses melanocyte markers (e.g., S100, Melan-A/MART-1).  3. Signaling Pathways:  - Hyperactivated MAPK/ERK pathway (typical of melanoma).  - Potential PI3K/AKT/mTOR pathway involvement.  4. Known Drug Response Profiles:  - Sensitivity to BRAF/MEK inhibitors (if BRAF-mutant).  - Possible resistance to immunotherapy (e.g., anti-PD-1) due to immunosuppressive microenvironment.  5. Cellular Microenvironment:  - Derived from metastatic site (lung), suggesting adaptation to heterotypic signaling.  - Limited immune cell infiltration (typical of advanced melanoma).  6. Key Biomarkers:  - Prognostic: High S100B or LDH (if secretory).  - Therapeutic targets: BRAF, MEK, or immune checkpoints (PD-L1).  (For precise genetic alterations, refer to DepMap/CCLE data.)",
    "ACH-000617": "OVCAR-4 Cell Line Description (DepMap ID: ACH-000617)  1. Cell Type and Origin: Epithelial ovarian cancer cell line derived from ascites of a patient with ovarian adenocarcinoma.  2. Molecular Signatures:  - Mutations: TP53 (common in ovarian cancer), BRCA1/2 wild-type.  - Protein expression: Overexpression of HER2, moderate CA-125 (MUC16) levels.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR, RAS/RAF/MEK/ERK.  - Inhibited: Apoptotic pathways (e.g., BCL-2 family dysregulation).  4. Known Drug Response Profiles:  - Sensitive: Platinum-based agents (e.g., cisplatin), taxanes (e.g., paclitaxel).  - Resistant: PARP inhibitors (due to BRCA1/2 wild-type status).  5. Cellular Microenvironment:  - Derived from ascites; likely exhibits hypoxia and nutrient stress.  - Minimal immune cell presence in vitro; may express PD-L1.  6. Key Biomarkers:  - Prognostic: CA-125 (MUC16).  - Therapeutic targets: HER2, PI3K/AKT/mTOR pathway components.",
    "ACH-000433": "Cell Line: CAKI-1  1. Cell Type and Origin:  - Derived from a clear cell renal cell carcinoma (ccRCC) metastasis to the skin.  2. Molecular Signatures:  - Harbors mutations in VHL (common in ccRCC), PBRM1, and SETD2.  - Overexpresses CAIX (carbonic anhydrase IX) and VEGF.  3. Signaling Pathways:  - Hypoxia-inducible factor (HIF) pathway activation due to VHL loss.  - mTOR and MAPK/ERK pathways are constitutively active.  4. Known Drug Response Profiles:  - Sensitive to tyrosine kinase inhibitors (e.g., sunitinib, pazopanib).  - Resistant to conventional chemotherapy (e.g., cisplatin).  5. Cellular Microenvironment:  - Minimal immune cell infiltration in vitro.  - ECM interactions may influence metastatic behavior.  6. Key Biomarkers:  - VHL mutation (diagnostic/therapeutic target).  - CAIX and PD-L1 (potential immunotherapy targets).",
    "ACH-000428": "Cell Line: UO-31  1. Cell type and origin: Renal cell carcinoma (Kidney Cancer) derived from kidney tissue.  2. Molecular signatures: Harbors mutations in VHL, PBRM1, and SETD2; exhibits loss of chromosome 3p. Overexpresses CAIX and VEGF.  3. Signaling pathways: Hypoxia-inducible factor (HIF) pathway activation due to VHL loss; mTOR and angiogenesis pathways dysregulated.  4. Known drug response profiles: Sensitive to mTOR inhibitors (e.g., everolimus) and VEGF-targeted therapies (e.g., sunitinib); resistant to conventional chemotherapy.  5. Cellular microenvironment: Hypoxic tumor niche; limited immune infiltration (low PD-L1 expression).  6. Key biomarkers: VHL mutation (diagnostic), CAIX (prognostic), VEGF (therapeutic target).",
    "ACH-000551": "1. Cell type and origin: K-562 is a human chronic myelogenous leukemia (CML) cell line derived from a pleural effusion. It is of erythroleukemic origin, representing blast crisis phase CML.  2. Molecular signatures: Harbors the BCR-ABL1 fusion gene (Philadelphia chromosome). Overexpresses MYC and lacks p53 activity. Commonly exhibits mutations in epigenetic regulators (e.g., ASXL1, TET2).  3. Signaling pathways: Hyperactive BCR-ABL1-driven MAPK/ERK and PI3K/AKT pathways. JAK-STAT signaling is dysregulated. Apoptosis pathways are often suppressed.  4. Known drug response profiles: Sensitive to tyrosine kinase inhibitors (e.g., imatinib, dasatinib). Resistant to conventional chemotherapy agents (e.g., cytarabine). Exhibits sensitivity to BET inhibitors and HDAC inhibitors.  5. Cellular microenvironment: Grows in suspension; lacks adherent extracellular matrix interactions. Minimal immune cell presence in vitro. Hypoxia-responsive pathways may be active.  6. Key biomarkers: BCR-ABL1 fusion is a primary therapeutic target. CD33 and CD123 are overexpressed surface markers. High ALDH activity marks stem-like populations.",
    "ACH-000338": "Cell Line Description for SR (DepMap ID: ACH-000338)  1. Cell Type and Origin:  - Derived from a pleural effusion in a lymphoma patient.  2. Molecular Signatures:  - Genetic mutations and protein expression profiles indicative of aggressive B-cell lymphoma (e.g., potential MYC amplification, TP53 mutations).  3. Signaling Pathways:  - Hyperactivated NF-κB and PI3K/AKT/mTOR pathways.  - Dysregulated B-cell receptor (BCR) signaling.  4. Known Drug Response Profiles:  - Sensitive to BCR inhibitors (e.g., ibrutinib) and proteasome inhibitors (e.g., bortezomib).  - Resistant to conventional chemotherapy agents (e.g., doxorubicin).  5. Cellular Microenvironment:  - Minimal extracellular matrix interaction due to suspension growth.  - Likely low immune cell presence (evasion of T-cell-mediated killing).  6. Key Biomarkers:  - CD19, CD20 (B-cell markers).  - BCL-2 overexpression (anti-apoptotic).  - PD-L1 expression (immune evasion).",
    "ACH-000825": "### Cell Line: HOP-92  1. Cell Type and Origin  - Derived from lung adenocarcinoma (non-small cell lung cancer, NSCLC).  - Tissue source: Lung.  2. Molecular Signatures  - Mutations: Common NSCLC mutations (e.g., KRAS, TP53).  - Protein expression: Overexpression of EGFR, HER2 in some variants.  3. Signaling Pathways  - Activated: MAPK/ERK (via KRAS), PI3K/AKT (via EGFR/HER2).  - Inhibited: p53 pathway (due to TP53 mutation).  4. Known Drug Response Profiles  - Sensitive to: EGFR inhibitors (e.g., erlotinib, gefitinib) in EGFR-expressing variants.  - Resistant to: Conventional chemotherapy (e.g., cisplatin) in some contexts.  5. Cellular Microenvironment  - Limited extracellular matrix interaction in vitro.  - Low immune cell infiltration (typical for established cancer cell lines).  6. Key Biomarkers  - Prognostic: KRAS mutation status.  - Therapeutic targets: EGFR, HER2, MEK (downstream of KRAS).",
    "ACH-000861": "1. Cell type and origin: HOP-62 is a human non-small cell lung cancer (NSCLC) cell line derived from lung tissue.  2. Molecular signatures: Harbors mutations in KRAS (G12C) and TP53, with moderate expression of EGFR and low MET expression.  3. Signaling pathways: Hyperactivation of MAPK/ERK due to KRAS mutation; PI3K/AKT pathway may be co-activated.  4. Known drug response profiles: Sensitive to MEK inhibitors (e.g., trametinib) and resistant to EGFR inhibitors (e.g., gefitinib).  5. Cellular microenvironment: Limited data on immune cell infiltration; likely exhibits a fibrotic extracellular matrix typical of NSCLC.  6. Key biomarkers: KRAS G12C (therapeutic target), TP53 loss (prognostic), PD-L1 expression (moderate, checkpoint target).",
    "ACH-000706": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from a lung adenocarcinoma.  2. Molecular signatures: Harbors mutations in KRAS (G12C) and TP53; exhibits moderate expression of EGFR and low MET amplification.  3. Signaling pathways: Hyperactivated MAPK/ERK pathway due to KRAS mutation; PI3K/AKT pathway moderately active; Wnt/β-catenin signaling dysregulated.  4. Known drug response profiles: Sensitive to MEK inhibitors (e.g., trametinib) and KRAS-G12C inhibitors (e.g., sotorasib); resistant to EGFR TKIs (e.g., erlotinib).  5. Cellular microenvironment: Low PD-L1 expression; minimal stromal interaction in vitro; lacks significant immune cell infiltration markers (e.g., CD8+ T cells).  6. Key biomarkers: KRAS G12C (therapeutic target); TP53 mutation (prognostic); low TMB (tumor mutational burden).",
    "ACH-000504": "1. Cell type and origin: SNB-75 is a human glioblastoma cell line derived from the central nervous system, representing an aggressive form of brain cancer.  2. Molecular signatures: Harbors common glioblastoma-associated mutations (e.g., TP53, PTEN loss, EGFR amplification). Overexpression of oncogenic proteins such as EGFRvIII and PDGFRα.  3. Signaling pathways: Hyperactivation of PI3K/AKT/mTOR and RAS/MAPK pathways due to PTEN loss and EGFR alterations. Dysregulated cell cycle progression via CDKN2A deletion.  4. Known drug response profiles: Sensitive to EGFR inhibitors (e.g., erlotinib) and PARP inhibitors (due to PTEN-deficient DNA repair defects). Resistant to standard temozolomide therapy.  5. Cellular microenvironment: Exhibits an immunosuppressive microenvironment with low immune cell infiltration. High extracellular matrix (ECM) remodeling activity via MMP overexpression.  6. Key biomarkers: EGFRvIII, PDGFRα, and MGMT methylation status as prognostic markers. Potential therapeutic targets include PI3K/mTOR and DNA damage response pathways.",
    "ACH-000817": "1. Cell type and origin: Human multiple myeloma cell line derived from haematopoietic and lymphoid tissue.  2. Molecular signatures: Harbors common myeloma mutations (e.g., KRAS, NRAS, TP53); expresses CD138 (syndecan-1), a plasma cell marker.  3. Signaling pathways: Hyperactivated NF-κB and PI3K/AKT pathways; dysregulated MAPK signaling due to RAS mutations.  4. Known drug response profiles: Sensitive to proteasome inhibitors (e.g., bortezomib); resistant to conventional chemotherapies like dexamethasone.  5. Cellular microenvironment: Grows in suspension; lacks significant extracellular matrix interactions; minimal immune cell presence in vitro.  6. Key biomarkers: CD138 (diagnostic marker); BCMA (therapeutic target); TP53 mutations (prognostic for resistance).",
    "ACH-001685": "Cell Line: U-HO1  1. Cell Type and Origin: Diffuse large B-cell lymphoma (DLBCL), derived from pleural effusion.  2. Molecular Signatures:  - Genetic mutations: BCL6 rearrangements, TP53 mutations.  - Protein expression: High BCL2, MYC overexpression (double-expressor phenotype).  3. Signaling Pathways:  - Activated: NF-κB, PI3K/AKT/mTOR, B-cell receptor signaling.  - Inhibited: Apoptotic pathways (e.g., suppressed BAX/BAK).  4. Known Drug Response Profiles:  - Sensitive: BCL2 inhibitors (venetoclax), PI3K inhibitors (idelalisib).  - Resistant: Conventional chemotherapy (e.g., CHOP regimen).  5. Cellular Microenvironment:  - Minimal extracellular matrix interaction (suspension culture).  - Limited immune cell presence (ex vivo model).  6. Key Biomarkers:  - Prognostic: MYC/BCL2 co-expression (aggressive phenotype).  - Therapeutic targets: CD19, BCL2, MYC.",
    "ACH-000702": "1. Cell type and origin: L-1236 is a Hodgkin lymphoma cell line derived from haematopoietic and lymphoid tissue.  2. Molecular signatures: Characterized by mutations in STAT6, SOCS1, and NFKBIA, and overexpression of CD30 (TNFRSF8) and PD-L1 (CD274).  3. Signaling pathways: Hyperactivation of JAK-STAT, NF-κB, and PI3K/AKT pathways; dysregulated apoptosis via BCL-2 family proteins.  4. Known drug response profiles: Sensitive to brentuximab vedotin (anti-CD30), resistant to conventional chemotherapy (e.g., doxorubicin).  5. Cellular microenvironment: Exhibits autocrine cytokine signaling (e.g., IL-13); limited extracellular matrix interaction; immune evasion via PD-L1.  6. Key biomarkers: CD30 (therapeutic target), PD-L1 (immune checkpoint), STAT6 activation (prognostic marker).",
    "ACH-000052": "1. Cell type and origin: Ewing sarcoma cell line derived from soft tissue; classified as a bone cancer model.  2. Molecular signatures: Characterized by EWSR1-FLI1 fusion oncogene; TP53 mutations common; high expression of CD99 (MIC2).  3. Signaling pathways: EWSR1-FLI1 drives aberrant MAPK/ERK and PI3K/AKT activation; IGF-1R pathway implicated in proliferation.  4. Known drug response profiles: Sensitive to IGF-1R inhibitors (e.g., linsitinib); resistant to conventional chemotherapies (e.g., doxorubicin) in some contexts.  5. Cellular microenvironment: Minimal extracellular matrix interaction in vitro; low immune cell infiltration in native tumors.  6. Key biomarkers: CD99 (diagnostic); EWSR1-FLI1 fusion (therapeutic target); STAG2 mutations (prognostic).",
    "ACH-000571": "Cell Line: T98G  1. Cell Type and Origin: Glioblastoma multiforme (GBM) cell line derived from the central nervous system.  2. Molecular Signatures:  - Mutations: TP53 (R273H), PTEN loss, TERT promoter mutation.  - Protein Expression: High EGFR expression, MGMT methylation-negative.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR, MAPK/ERK, NF-κB.  - Inhibited: Apoptotic pathways due to Bcl-2 overexpression.  4. Known Drug Response Profiles:  - Resistant to temozolomide (due to MGMT unmethylation).  - Sensitive to PI3K/AKT/mTOR inhibitors (e.g., everolimus).  5. Cellular Microenvironment:  - Extracellular matrix: High fibronectin and collagen secretion.  - Immune cell presence: Low immune infiltration in vitro.  6. Key Biomarkers:  - Prognostic: EGFR amplification, PTEN loss.  - Therapeutic Targets: EGFR, PI3K/AKT/mTOR pathway.",
    "ACH-000097": "Cell Line Description: ZR751 (DepMap ID: ACH-000097)  1. Cell Type and Origin:  - Derived from metastatic breast adenocarcinoma.  - Tissue source: Ascites fluid.  2. Molecular Signatures:  - ER-positive (estrogen receptor), PR-negative (progesterone receptor), HER2-negative.  - Common mutations: TP53, PIK3CA, and ESR1 mutations reported.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR pathway (due to PIK3CA mutations), estrogen signaling (ER+).  - Inhibited: HER2 signaling (HER2-negative).  4. Known Drug Response Profiles:  - Sensitive to endocrine therapies (e.g., tamoxifen, aromatase inhibitors).  - Resistance to HER2-targeted therapies (e.g., trastuzumab).  - May exhibit resistance to chemotherapy agents (e.g., taxanes) due to TP53 mutations.  5. Cellular Microenvironment:  - Derived from ascites, suggesting a fluid-phase tumor microenvironment.  - Limited extracellular matrix interaction; potential immune evasion due to metastatic origin.  6. Key Biomarkers:  - Prognostic: ER status (predicts endocrine therapy response).  - Therapeutic targets: ESR1, PIK3CA, mTOR.  - Potential resistance markers: TP53 mutations.",
    "ACH-000028": "1. Cell type and origin:  - Epithelial cell line derived from breast cancer.  - Origin: Pleural effusion (metastatic site).  2. Molecular signatures:  - HER2-amplified (ERBB2+).  - Common mutations in TP53 and PIK3CA.  - Hormone receptor status: Estrogen receptor (ER)-negative, progesterone receptor (PR)-negative.  3. Signaling pathways:  - Hyperactivated PI3K/AKT/mTOR pathway due to PIK3CA mutations.  - HER2-driven MAPK/ERK signaling.  - Likely dysregulated cell cycle control (TP53 mutation).  4. Known drug response profiles:  - Sensitive to HER2-targeted therapies (e.g., trastuzumab, lapatinib).  - Resistance to endocrine therapies (ER/PR-negative).  - Potential sensitivity to PI3K/AKT/mTOR inhibitors.  5. Cellular microenvironment:  - Derived from metastatic pleural effusion, suggesting adaptation to fluid-phase microenvironment.  - Limited data on immune cell interactions or extracellular matrix composition.  6. Key biomarkers:  - HER2 amplification (primary therapeutic target).  - TP53 and PIK3CA mutations (prognostic and predictive relevance).  - ER/PR negativity (excludes hormonal therapy options).",
    "ACH-000573": "1. Cell type and origin: Epithelial cell line derived from pleural effusion of metastatic breast adenocarcinoma (triple-negative subtype).  2. Molecular signatures:  - Mutations: TP53 (R248W), PTEN (frameshift), BRCA1 (splice site).  - Protein expression: Low ER/PR/HER2, high EGFR, PD-L1+.  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR (PTEN loss), EGFR/RAS/MAPK.  - Inhibited: BRCA1-dependent DNA repair.  4. Known drug response profiles:  - Sensitive: PARP inhibitors (olaparib), EGFR inhibitors (gefitinib).  - Resistant: Endocrine therapies (tamoxifen), HER2-targeted agents.  5. Cellular microenvironment:  - Extracellular matrix: High fibronectin secretion.  - Immune cell presence: Low tumor-infiltrating lymphocytes (TILs).  6. Key biomarkers:  - Prognostic: PTEN loss (poor prognosis).  - Therapeutic targets: PARP (BRCA1 deficiency), EGFR/PD-L1.",
    "ACH-000943": "1. Cell type and origin: Epithelial cell line derived from colon adenocarcinoma (Colon/Colorectal Cancer).  2. Molecular signatures:  - Mutations: APC (truncating), TP53 (missense), KRAS (G13D), PIK3CA (E545K).  - Mismatch repair-deficient (MSI-H due to MLH1 promoter methylation).  - High Wnt/β-catenin signaling due to APC loss.  3. Signaling pathways:  - Hyperactive MAPK/ERK (KRAS mutation).  - PI3K/AKT/mTOR pathway activation (PIK3CA mutation).  - Deficient TGF-β signaling (SMAD4 wild-type but downstream suppression).  4. Known drug response profiles:  - Sensitive to EGFR inhibitors (cetuximab) but resistance common due to KRAS mutation.  - Responsive to MEK inhibitors (trametinib) and PI3K/mTOR inhibitors.  - Resistant to 5-FU monotherapy (MSI-H phenotype).  5. Cellular microenvironment:  - Low immune infiltration (cold tumor phenotype).  - Produces TGF-β and VEGF, contributing to immunosuppression.  6. Key biomarkers:  - MSI-H status (predictive of immunotherapy response).  - KRAS G13D (therapeutic target for MAPK pathway inhibitors).  - β-catenin nuclear accumulation (Wnt pathway activation marker).",
    "ACH-000421": "1. Cell type and origin: Epithelial cell line derived from colorectal adenocarcinoma (large intestine).  2. Molecular signatures:  - Mutations: APC, KRAS, TP53, PIK3CA.  - Microsatellite instability (MSI) status: Microsatellite stable (MSS).  - Protein expression: High EGFR, moderate HER2.  3. Signaling pathways:  - Activated: RAS/RAF/MEK/ERK, PI3K/AKT/mTOR.  - Inhibited: TGF-β signaling.  4. Known drug response profiles:  - Sensitive: EGFR inhibitors (cetuximab), MEK inhibitors (trametinib).  - Resistant: 5-FU, oxaliplatin.  5. Cellular microenvironment:  - Extracellular matrix: Collagen-rich.  - Immune cell presence: Low tumor-infiltrating lymphocytes (TILs).  6. Key biomarkers:  - Prognostic: High KRAS mutation (poor prognosis).  - Therapeutic targets: EGFR, HER2, MEK.",
    "ACH-000395": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line, derived from a squamous cell carcinoma of the lung.  2. Molecular signatures: Harbors mutations in TP53 and PIK3CA; expresses KRAS wild-type. Overexpresses SOX2 and exhibits epigenetic alterations in CDKN2A.  3. Signaling pathways: Hyperactivation of PI3K/AKT/mTOR pathway; dysregulated Wnt/β-catenin signaling. Moderate EGFR pathway activity despite lack of EGFR mutations.  4. Known drug response profiles: Sensitive to cisplatin and paclitaxel; resistant to single-agent EGFR inhibitors (e.g., gefitinib). Responds to PI3K/mTOR inhibitors (e.g., everolimus).  5. Cellular microenvironment: Minimal endogenous immune cell infiltration; secretes IL-6 and VEGF, suggesting pro-angiogenic and immunosuppressive properties.  6. Key biomarkers: High PD-L1 expression (potential immune checkpoint target); SOX2 as a stemness marker; CDKN2A loss as a prognostic indicator.",
    "ACH-000115": "1. Cell type and origin: Prostate cancer cell line derived from a metastatic bone lesion (vertebral metastasis).  2. Molecular signatures:  - Harbors androgen receptor (AR) amplification and PTEN deletion.  - Expresses high levels of ETS-related gene (ERG) due to TMPRSS2-ERG fusion.  - Mutations in TP53, RB1, and SPOP.  3. Signaling pathways:  - Hyperactivated PI3K/AKT/mTOR pathway due to PTEN loss.  - AR signaling drives proliferation despite castration resistance.  - Wnt/β-catenin pathway dysregulation.  4. Known drug response profiles:  - Sensitive to AR-targeting agents (e.g., enzalutamide, abiraterone) but develops resistance.  - Resistant to docetaxel in later passages.  - Vulnerable to PI3K/AKT inhibitors (e.g., ipatasertib).  5. Cellular microenvironment:  - Bone-mimicking niche influences metastatic behavior.  - Low immune cell infiltration in vitro; lacks robust immune microenvironment modeling.  6. Key biomarkers:  - AR splice variants (e.g., AR-V7) associated with therapy resistance.  - ERG overexpression as a diagnostic marker.  - Elevated PSA (prostate-specific antigen) secretion.",
    "ACH-001061": "Cell Line: DLD1  1. Cell Type and Origin: Colorectal adenocarcinoma cell line derived from the large intestine.  2. Molecular Signatures:  - Common mutations: APC (truncating), TP53 (missense), KRAS (G13D), PIK3CA (E545K).  - Mismatch repair-deficient (MLH1 methylation leading to microsatellite instability).  3. Signaling Pathways:  - Activated: Wnt/β-catenin (due to APC loss), MAPK/ERK (KRAS-driven), PI3K/AKT (PIK3CA mutation).  - Suppressed: TGF-β signaling (SMAD4 wild-type but context-dependent inhibition).  4. Known Drug Response Profiles:  - Sensitive to EGFR inhibitors (cetuximab) in KRAS wild-type contexts, but resistant due to KRAS G13D.  - Responsive to MEK inhibitors (trametinib) and PI3K inhibitors (alpelisib) as monotherapies.  5. Cellular Microenvironment:  - Epithelial morphology with moderate stromal interaction in vitro.  - Low immune cell infiltration in native context (microsatellite instability may alter immunogenicity).  6. Key Biomarkers:  - Prognostic: Microsatellite instability-high (MSI-H) status.  - Therapeutic targets: KRAS G13D, PI3K/AKT pathway, Wnt signaling components.",
    "ACH-000322": "1. Cell type and origin: HT144 is a human melanoma cell line derived from skin, representing an aggressive form of skin cancer.  2. Molecular signatures: Harbors mutations in BRAF (e.g., V600E), NRAS, and PTEN, with overexpression of MITF and cyclin D1.  3. Signaling pathways: Hyperactivation of MAPK/ERK and PI3K/AKT pathways due to BRAF mutation; dysregulated cell cycle progression.  4. Known drug response profiles: Sensitive to BRAF inhibitors (e.g., vemurafenib) and MEK inhibitors; resistant to monotherapy with immune checkpoint inhibitors.  5. Cellular microenvironment: Exhibits low immunogenicity with minimal immune cell infiltration; secretes pro-angiogenic factors (e.g., VEGF).  6. Key biomarkers: BRAF V600E as a primary therapeutic target; elevated S100B and LDH as prognostic markers.",
    "ACH-000657": "1. Cell type and origin: Epithelial ovarian cancer cell line derived from the ovary; primary disease is ovarian cancer.  2. Molecular signatures:  - Common mutations: TP53 (loss-of-function), BRCA1/2 (occasional), PTEN deletion.  - Overexpression of ERBB2 (HER2) and MDR1 (multidrug resistance protein).  3. Signaling pathways:  - Hyperactivated PI3K/AKT/mTOR pathway.  - Dysregulated DNA damage repair (homologous recombination deficiency).  - Elevated MAPK/ERK signaling.  4. Known drug response profiles:  - Sensitive to platinum-based chemotherapies (e.g., cisplatin, carboplatin) but develops resistance.  - Resistance to paclitaxel and doxorubicin due to MDR1 overexpression.  - Responsive to PARP inhibitors (e.g., olaparib) in BRCA-mutated contexts.  5. Cellular microenvironment:  - Limited extracellular matrix interaction in vitro.  - Low immune cell infiltration in native context; lacks PD-L1 expression.  6. Key biomarkers:  - CA-125 (elevated in clinical correlates).  - HER2 (potential therapeutic target).  - BRCA1/2 status (predicts PARP inhibitor response).",
    "ACH-000950": "1. Cell type and origin: Epithelial cell line derived from metastatic colon adenocarcinoma; originating from lymph node metastasis.  2. Molecular signatures:  - Mutations: APC (truncating), KRAS (G12D), TP53 (R273H), SMAD4 (loss).  - Microsatellite instability (MSI) status: Stable (MSS).  - Protein overexpression: EGFR, HER2 (low).  3. Signaling pathways:  - Activated: MAPK/ERK (KRAS-driven), WNT/β-catenin (APC loss), PI3K/AKT (EGFR).  - Inhibited: TGF-β/SMAD (SMAD4 loss).  4. Known drug response profiles:  - Sensitive: EGFR inhibitors (cetuximab, panitumumab; conditional on KRAS WT status, but LOVO is KRAS-mutated).  - Resistant: 5-FU (TP53/SMAD4 alterations), MEK inhibitors (KRAS-mediated resistance).  5. Cellular microenvironment:  - Lymph node-derived; likely retains some stromal interactions (e.g., fibroblast/immune crosstalk).  - Low immune infiltrate in vitro; minimal PD-L1 expression.  6. Key biomarkers:  - Prognostic: KRAS G12D (poor response to anti-EGFR therapy).  - Therapeutic targets: BRAF (WT), HER2 (low), MET (unamplified).",
    "ACH-000757": "Cell Line: A427 (DepMap ID: ACH-000757)  1. Cell Type and Origin:  - Derived from lung adenocarcinoma (non-small cell lung cancer, NSCLC).  - Tissue source: Lung.  2. Molecular Signatures:  - Common mutations: KRAS (G12V), TP53 (R273H), STK11 (loss).  - Overexpression of EGFR, MET; low PD-L1 expression.  3. Signaling Pathways:  - Hyperactivated MAPK/ERK (KRAS-driven), mTOR (STK11 loss).  - Impaired AMPK signaling (STK11 mutation).  4. Known Drug Response Profiles:  - Sensitive to MEK inhibitors (trametinib), mTOR inhibitors (everolimus).  - Resistant to EGFR TKIs (erlotinib, gefitinib).  5. Cellular Microenvironment:  - Low immune infiltration (cold tumor phenotype).  - Fibronectin-rich extracellular matrix.  6. Key Biomarkers:  - Prognostic: KRAS mutation status.  - Therapeutic targets: MET, mTOR.",
    "ACH-000335": "### Cell Line Description: MSTO (DepMap ID: ACH-000335)  1. Cell Type and Origin:  - Derived from a pleural effusion of a biphasic mesothelioma (Lung Cancer subtype).  2. Molecular Signatures:  - Harbors mutations in BAP1 and NF2, common in mesothelioma.  - Overexpresses mesothelial markers (e.g., calretinin, WT1).  3. Signaling Pathways:  - Hyperactivated PI3K/AKT/mTOR and Hippo pathways due to NF2 loss.  - Dysregulated apoptosis via BAP1 inactivation.  4. Known Drug Response Profiles:  - Sensitive to pemetrexed (standard mesothelioma therapy).  - Resistant to EGFR inhibitors due to lacking EGFR mutations.  5. Cellular Microenvironment:  - Originally from pleural fluid, modeling effusion-associated tumor growth.  - Limited immune infiltration in vitro; may exhibit immunosuppressive traits.  6. Key Biomarkers:  - Prognostic: Low BAP1 expression linked to poor survival.  - Therapeutic targets: Mesothelin (MSLN), mTOR pathway components.",
    "ACH-000713": "1. Cell type and origin: Epithelial ovarian cancer cell line derived from the ovary.  2. Molecular signatures: Harbors TP53 mutation; overexpresses HER2/ERBB2 and epithelial markers (e.g., EpCAM). Exhibits copy number alterations in PI3K/AKT and RAS/MAPK pathways.  3. Signaling pathways: Hyperactivated PI3K/AKT/mTOR and RAS/RAF/MEK/ERK pathways; deficient homologous recombination repair (HRD-like phenotype).  4. Known drug response profiles: Sensitive to PARP inhibitors (e.g., olaparib) due to HRD; resistant to platinum-based chemotherapies; responsive to HER2-targeted therapies (e.g., trastuzumab).  5. Cellular microenvironment: Limited immune cell infiltration in vitro; exhibits mesenchymal-like features with moderate extracellular matrix (ECM) interaction.  6. Key biomarkers: TP53 (mutation), HER2/ERBB2 (overexpression), CA-125 (elevated), BRCA1/2 (wild-type but HRD phenotype).",
    "ACH-000291": "Cell Line: OV90  1. Cell Type and Origin: Epithelial ovarian cancer cell line derived from ascites of a patient with ovarian adenocarcinoma.  2. Molecular Signatures:  - Mutations: TP53 (common in high-grade serous ovarian cancer), BRCA1/2 wildtype.  - Protein expression: Overexpression of HER2, CA-125 (MUC16), and mesothelin.  3. Signaling Pathways:  - Activated: PI3K/AKT, MAPK/ERK, Wnt/β-catenin.  - Inhibited: Apoptotic pathways due to BCL-2 dysregulation.  4. Known Drug Response Profiles:  - Sensitive: Platinum-based agents (cisplatin, carboplatin), PARP inhibitors (olaparib).  - Resistant: Taxanes (paclitaxel) in some contexts; potential resistance to EGFR inhibitors.  5. Cellular Microenvironment:  - Ascites-derived, indicating exposure to hypoxic and inflammatory conditions.  - Limited immune cell infiltration in vitro; high stromal interaction potential.  6. Key Biomarkers:  - Prognostic: High CA-125 levels.  - Therapeutic targets: HER2, mesothelin, PARP (if homologous recombination deficient).",
    "ACH-001418": "1. Cell type and origin: Ovarian cancer cell line derived from ovarian tissue.  2. Molecular signatures: BRCA1 mutation (germline), TP53 mutation; low HER2 expression, high PARP1 expression.  3. Signaling pathways: Homologous recombination deficiency (HRD); hyperactivated PI3K/AKT due to PTEN loss; impaired DNA repair.  4. Known drug response profiles: Sensitive to PARP inhibitors (e.g., olaparib); resistant to platinum-based chemotherapies.  5. Cellular microenvironment: Minimal extracellular matrix interaction; low immune cell infiltration in vitro.  6. Key biomarkers: BRCA1 (prognostic), PARP1 (therapeutic target); HRD score as a predictive biomarker.",
    "ACH-000665": "Cell Line: SKMES1  1. Cell Type and Origin: Non-small cell lung cancer (NSCLC) cell line derived from pleural effusion of a squamous cell carcinoma patient.  2. Molecular Signatures:  - Mutations: TP53 (R282W), CDKN2A loss, PIK3CA (E545K), KEAP1 mutations.  - Protein expression: High EGFR expression, low PD-L1.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR (PIK3CA-driven), MAPK/ERK.  - Inhibited: p53 pathway (TP53 mutation).  4. Known Drug Response Profiles:  - Sensitive to EGFR inhibitors (e.g., erlotinib), PI3K/mTOR inhibitors.  - Resistant to cisplatin, paclitaxel.  5. Cellular Microenvironment: Derived from pleural effusion; lacks strong extracellular matrix interactions, minimal intrinsic immune cell presence.  6. Key Biomarkers:  - Prognostic: TP53 mutation (poor prognosis).  - Therapeutic targets: EGFR, PI3K/AKT/mTOR.",
    "ACH-000035": "1. Cell type and origin: Non-small cell lung cancer (NSCLC), adenocarcinoma subtype; derived from pleural effusion.  2. Molecular signatures: Harbors EML4-ALK fusion (variant 3a/b); mutations in TP53, CDKN2A, and STK11; low EGFR expression.  3. Signaling pathways: ALK pathway activation; PI3K/AKT/mTOR and RAS/RAF/MEK/ERK dysregulation due to STK11 loss.  4. Known drug response profiles: Sensitive to ALK inhibitors (e.g., crizotinib); resistant to EGFR inhibitors (e.g., gefitinib).  5. Cellular microenvironment: Limited data on immune infiltrates; likely exhibits immunosuppressive traits (e.g., low PD-L1 expression).  6. Key biomarkers: EML4-ALK fusion (targetable); TP53 mutation (prognostic); STK11 loss (predictive of therapy resistance).",
    "ACH-000906": "1. Cell type and origin: ES2 is a human ovarian clear cell carcinoma cell line derived from the ovary.  2. Molecular signatures: Harbors mutations in TP53 and PIK3CA; exhibits high expression of HER2 and EGFR.  3. Signaling pathways: Hyperactivation of PI3K/AKT/mTOR pathway; dysregulated Wnt/β-catenin signaling.  4. Known drug response profiles: Sensitive to PI3K/mTOR inhibitors (e.g., everolimus); resistant to platinum-based chemotherapies.  5. Cellular microenvironment: Limited immune cell infiltration; exhibits high extracellular matrix (ECM) remodeling activity.  6. Key biomarkers: Overexpression of CA-125 (MUC16); potential therapeutic targets include HER2 and PI3K/AKT pathway components.",
    "ACH-001374": "1. Cell type and origin: Ovarian cancer cell line derived from ascites.  2. Molecular signatures:  - Mutations: TP53 (common in ovarian cancer), potential BRCA1/2 alterations.  - Protein expression: High expression of CA-125 (MUC16), EpCAM.  3. Signaling pathways:  - Activated: PI3K/AKT, Wnt/β-catenin.  - Inhibited: p53-dependent apoptosis.  4. Known drug response profiles:  - Sensitive to platinum-based agents (e.g., cisplatin), PARP inhibitors.  - Resistant to taxanes in some contexts.  5. Cellular microenvironment:  - Ascites-derived, suggesting exposure to hypoxic and inflammatory conditions.  - Limited extracellular matrix interaction in suspension culture.  6. Key biomarkers:  - CA-125 (diagnostic/prognostic), HER2 (potential target), BRCA status (predicts PARPi response).",
    "ACH-000311": "Cell Line: NCI-H2122  1. Cell Type and Origin: Non-small cell lung cancer (NSCLC) cell line derived from a pleural effusion.  2. Molecular Signatures:  - Common mutations: KRAS (G12C), STK11 (loss), TP53 (mutated).  - Low expression of KEAP1, high expression of NFE2L2 (Nrf2 pathway activation).  3. Signaling Pathways:  - Hyperactivated MAPK/ERK pathway (KRAS-driven).  - Impaired AMPK signaling (STK11 loss).  - Elevated Nrf2-mediated oxidative stress response.  4. Known Drug Response Profiles:  - Sensitive to MEK inhibitors (e.g., trametinib).  - Resistant to EGFR inhibitors due to KRAS mutation.  - Potential sensitivity to ROS-inducing agents (Nrf2 dependency).  5. Cellular Microenvironment:  - Derived from pleural effusion (fluid-associated tumor cells).  - Limited data on immune cell interactions; likely low T-cell infiltration.  6. Key Biomarkers:  - KRAS G12C (therapeutic target for KRAS inhibitors).  - STK11 loss (predictor of mTOR pathway dependency).  - Nrf2 activation (prognostic for oxidative stress resistance).",
    "ACH-000783": "1. Cell type and origin: Epithelial cell line derived from breast adenocarcinoma; isolated from pleural effusion.  2. Molecular signatures:  - Mutations: TP53 (R273H), PIK3CA (E545K), ESR1 amplification.  - Protein expression: ER-positive, HER2-negative, PR-low.  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR (due to PIK3CA mutation), ER signaling.  - Inhibited: RB pathway (likely due to TP53 mutation).  4. Known drug response profiles:  - Sensitive: Fulvestrant (ER antagonist), PI3K inhibitors (e.g., Alpelisib).  - Resistant: Trastuzumab (HER2-negative), taxanes (moderate resistance).  5. Cellular microenvironment:  - Minimal endogenous immune cell presence; adherent growth in vitro.  - ECM interaction: Expresses integrins (α6β4) for laminin adhesion.  6. Key biomarkers:  - Prognostic: ESR1 amplification (predicts endocrine therapy response).  - Therapeutic targets: PI3K (E545K), ER (hormone therapy).",
    "ACH-000934": "Cell Line Description: MDA-MB-361  1. Cell Type and Origin:  - Derived from metastatic breast adenocarcinoma (primary disease: Breast Cancer).  - Sample collection site: central nervous system (CNS), indicating brain metastasis.  2. Molecular Signatures:  - Harbors ERBB2 (HER2) amplification and PIK3CA mutations (common in breast cancer).  - Expresses estrogen receptor (ER) and progesterone receptor (PR).  3. Signaling Pathways:  - Hyperactivated PI3K/AKT/mTOR pathway due to PIK3CA mutations.  - HER2-driven signaling promotes cell proliferation and survival.  4. Known Drug Response Profiles:  - Sensitive to HER2-targeted therapies (e.g., trastuzumab, lapatinib).  - Resistance to endocrine therapies (e.g., tamoxifen) due to HER2 dominance.  5. Cellular Microenvironment:  - Metastatic CNS origin suggests adaptation to neural tissue ECM.  - Limited data on immune cell presence; likely low immunogenicity.  6. Key Biomarkers:  - HER2 overexpression (therapeutic target).  - PIK3CA mutation (predictor of PI3K inhibitor response).  - ER/PR status (potential for combined hormonal therapy).",
    "ACH-000927": "1. Cell type and origin: BT-474 is a human breast adenocarcinoma cell line derived from invasive ductal carcinoma tissue.  2. Molecular signatures:  - Overexpresses HER2 (ERBB2) due to gene amplification.  - Hormone receptor-positive (ER+, PR+).  - Common mutations include PIK3CA (H1047R) and TP53 alterations.  3. Signaling pathways:  - Hyperactivated HER2/PI3K/AKT/mTOR pathway.  - ER-mediated signaling due to estrogen receptor expression.  4. Known drug response profiles:  - Sensitive to HER2-targeted therapies (e.g., trastuzumab, lapatinib).  - Responsive to endocrine therapies (e.g., tamoxifen, fulvestrant).  - Resistance to monotherapy PI3K inhibitors due to compensatory pathways.  5. Cellular microenvironment:  - Epithelial morphology with moderate stromal interaction in vitro.  - Limited immune cell infiltration in standard culture conditions.  6. Key biomarkers:  - HER2 (predictive for anti-HER2 therapies).  - ER/PR (predictive for endocrine therapy response).  - PIK3CA mutation (potential target for PI3K inhibitors).",
    "ACH-000277": "Cell Line Description: HCC1419 (DepMap ID: ACH-000277)  1. Cell Type and Origin: Epithelial cell line derived from breast tissue; primary disease: Breast Cancer (luminal subtype).  2. Molecular Signatures:  - Genetic mutations: PIK3CA (H1047R), TP53 (R273C), GATA3 (splice site), and CDH1 (E-cadherin loss).  - Protein expression: ER/PR-positive, HER2-negative.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR (due to PIK3CA mutation), estrogen receptor signaling.  - Inhibited: Apoptosis pathways (via TP53 mutation).  4. Known Drug Response Profiles:  - Sensitive: PI3K inhibitors (e.g., alpelisib), estrogen pathway modulators (e.g., tamoxifen).  - Resistant: HER2-targeted therapies (e.g., trastuzumab).  5. Cellular Microenvironment:  - Limited data; likely low immune infiltration (luminal subtype). Extracellular matrix interactions may influence adhesion-dependent signaling.  6. Key Biomarkers:  - Prognostic: ER/PR status (favorable).  - Therapeutic targets: PIK3CA, ERα.",
    "ACH-000568": "1. Cell type and origin: Epithelial cell line derived from invasive ductal carcinoma of the breast; primary disease is breast cancer.  2. Molecular signatures:  - Mutations: PIK3CA (H1047R), TP53 (R273H), PTEN loss.  - Protein expression: High HER2 (ERBB2) amplification, moderate ER (ESR1) expression.  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR (due to PIK3CA mutation), HER2/ERBB2 signaling.  - Inhibited: p53 pathway (due to TP53 mutation).  4. Known drug response profiles:  - Sensitive: HER2-targeted therapies (e.g., trastuzumab), PI3K inhibitors (e.g., alpelisib).  - Resistant: Endocrine therapies (e.g., tamoxifen) due to PIK3CA mutation.  5. Cellular microenvironment:  - Extracellular matrix: Collagen-rich, fibronectin-expressing.  - Immune cell presence: Low tumor-infiltrating lymphocytes (TILs).  6. Key biomarkers:  - Prognostic: HER2 amplification (aggressive phenotype).  - Therapeutic targets: HER2, PI3K, mTOR.",
    "ACH-000349": "Cell Line Description: HCC1500  1. Cell Type and Origin: Epithelial cell line derived from primary breast adenocarcinoma (luminal subtype).  2. Molecular Signatures:  - Mutations: _PIK3CA_ (H1047R), _TP53_ (R175H), _GATA3_ (splice site).  - Amplifications: _CCND1_, _FGFR1_.  - Hormone receptor status: ER+, PR+, HER2-.  3. Signaling Pathways:  - Hyperactive PI3K/AKT/mTOR pathway (due to _PIK3CA_ mutation).  - Dysregulated cell cycle (CCND1 amplification).  - Moderate MAPK pathway activity.  4. Known Drug Response Profiles:  - Sensitive to PI3K/mTOR inhibitors (e.g., alpelisib, everolimus).  - Resistant to HER2-targeted therapies (trastuzumab).  - Responsive to CDK4/6 inhibitors (e.g., palbociclib) due to _CCND1_ amplification.  5. Cellular Microenvironment:  - Limited immune cell infiltration (low PD-L1 expression).  - ECM composition typical of luminal breast cancer (collagen-rich).  6. Key Biomarkers:  - Prognostic: ER/PR positivity (predicts endocrine therapy response).  - Therapeutic targets: PI3K, CDK4/6, FGFR1.",
    "ACH-000759": "1. Cell type and origin: Epithelial cell line derived from pleural effusion of metastatic breast cancer (ductal carcinoma).  2. Molecular signatures: HER2-negative, estrogen receptor (ER)-positive; mutations in PIK3CA (H1047R), TP53; amplifications in CCND1, FGFR1.  3. Signaling pathways: Hyperactivated PI3K/AKT/mTOR pathway due to PIK3CA mutation; aberrant cell cycle progression via CCND1 amplification; RAS/MAPK pathway involvement.  4. Known drug response profiles: Sensitive to PI3K/mTOR inhibitors (e.g., alpelisib, everolimus); resistant to HER2-targeted therapies; partial response to endocrine therapies (e.g., tamoxifen).  5. Cellular microenvironment: Minimal native immune cell presence in vitro; adherent growth with moderate stromal interaction potential.  6. Key biomarkers: ER (ESR1) as therapeutic target; PIK3CA mutation for targeted therapy; cyclin D1 (CCND1) overexpression as prognostic marker.",
    "ACH-000473": "1. Cell type and origin: Epithelial cell line derived from urinary tract; primary disease: Bladder Cancer (urothelial carcinoma).  2. Molecular signatures: Common mutations in TP53, FGFR3, and PIK3CA; overexpression of EGFR and HER2.  3. Signaling pathways: Activated PI3K/AKT/mTOR and RAS/RAF/MEK pathways; dysregulated cell cycle progression.  4. Known drug response profiles: Sensitive to FGFR inhibitors (e.g., erdafitinib) and PI3K inhibitors; resistant to conventional cisplatin-based chemotherapy.  5. Cellular microenvironment: Limited extracellular matrix interaction; low immune cell infiltration (immunologically \"cold\").  6. Key biomarkers: FGFR3 mutations (therapeutic target); high PD-L1 expression (potential immune checkpoint target).",
    "ACH-000384": "1. Cell type and origin: Epithelial cell line derived from urinary tract; primary disease: Bladder Cancer (urothelial carcinoma).  2. Molecular signatures: Common mutations in TP53, RB1, and TSC1; overexpression of EGFR and HER2; frequent copy number alterations in chromosome 9p (CDKN2A loss).  3. Signaling pathways: Hyperactivated PI3K/AKT/mTOR pathway due to TSC1 mutations; dysregulated cell cycle (CDKN2A loss); EGFR/HER2-mediated MAPK/ERK signaling.  4. Known drug response profiles: Sensitive to EGFR inhibitors (e.g., erlotinib) and mTOR inhibitors (e.g., everolimus); resistant to conventional chemotherapy (e.g., cisplatin).  5. Cellular microenvironment: Limited extracellular matrix interaction; low immune cell infiltration (immunologically \"cold\" tumor model).  6. Key biomarkers: EGFR, HER2 (therapeutic targets); TP53 mutation (prognostic marker); CDKN2A loss (predictive of cyclin-dependent kinase inhibitor response).",
    "ACH-000880": "Cell Line: AGS (DepMap ID: ACH-000880)  1. Cell Type and Origin: Gastric adenocarcinoma cell line derived from stomach tissue; primary disease: Gastric Cancer.  2. Molecular Signatures:  - Common mutations: TP53 (R196), ARID1A (splice site), CDH1 (E404).  - Overexpression: HER2, MET, EGFR.  - Epigenetic alterations: Promoter hypermethylation of CDKN2A.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR, RAS/RAF/MEK/ERK, Wnt/β-catenin.  - Inhibited: TGF-β signaling due to SMAD4 loss.  4. Known Drug Response Profiles:  - Sensitive: Trastuzumab (HER2+), MET inhibitors (e.g., crizotinib).  - Resistant: 5-FU, cisplatin (common chemotherapies).  5. Cellular Microenvironment:  - Limited extracellular matrix interaction in vitro; low immune cell infiltration (low PD-L1 expression).  6. Key Biomarkers:  - Prognostic: HER2 amplification (predicts trastuzumab response).  - Therapeutic targets: MET, EGFR, PI3K.",
    "ACH-000547": "1. Cell type and origin: HT-1197 is a human bladder carcinoma cell line derived from the urinary tract. It represents an aggressive, high-grade urothelial cancer model.  2. Molecular signatures: Harbors mutations in TP53 and RB1, common in bladder cancer. Overexpresses EGFR and HER2, with frequent copy number alterations in cell cycle regulators (e.g., CCND1).  3. Signaling pathways: Hyperactivation of PI3K/AKT/mTOR and MAPK pathways due to upstream receptor tyrosine kinase (RTK) dysregulation. Wnt/β-catenin signaling may contribute to invasiveness.  4. Known drug response profiles: Sensitive to EGFR/HER2 inhibitors (e.g., lapatinib) and PI3K/AKT inhibitors (e.g., pictilisib). Resistant to conventional cisplatin-based chemotherapy.  5. Cellular microenvironment: Exhibits autocrine signaling with VEGF/PDGF secretion, suggesting angiogenic potential. Limited data on immune cell interactions, but low PD-L1 expression implies weak immunogenicity.  6. Key biomarkers: TP53 mutation (prognostic), EGFR/HER2 overexpression (therapeutic targets), and high Ki-67 index (proliferation marker).",
    "ACH-000396": "1. Cell type and origin: J82 is a human bladder carcinoma cell line derived from the urinary tract, representing an invasive high-grade urothelial cancer model.  2. Molecular signatures: Harbors mutations in TP53 and RB1, with overexpression of EGFR and HER2. Exhibits loss of CDKN2A (p16) and dysregulation in cell cycle control genes.  3. Signaling pathways: Hyperactivation of PI3K/AKT/mTOR and MAPK pathways due to upstream receptor tyrosine kinase signaling. Dysregulated p53 and RB pathways contribute to proliferation.  4. Known drug response profiles: Sensitive to cisplatin and gemcitabine (standard bladder cancer chemotherapies). Resistant to EGFR inhibitors (e.g., erlotinib) due to compensatory signaling.  5. Cellular microenvironment: Cultured as a monolayer; lacks native extracellular matrix or immune components unless co-cultured. Retains some epithelial-mesenchymal transition (EMT) features.  6. Key biomarkers: EGFR, HER2 (potential therapeutic targets); p53 mutation (prognostic); high Ki-67 (proliferation marker).",
    "ACH-000720": "Cell Line Description: TCCSUP (DepMap ID: ACH-000720)  1. Cell Type and Origin:  - Derived from a human urinary tract transitional cell carcinoma (TCC).  - Represents invasive high-grade bladder cancer.  2. Molecular Signatures:  - Harbors mutations in TP53 (loss of function), RB1 (deletion), and TSC1 (inactivating).  - Overexpresses EGFR and HER2; lacks FGFR3 alterations.  3. Signaling Pathways:  - Hyperactivated PI3K/AKT/mTOR due to TSC1 loss and EGFR/HER2 signaling.  - Impaired cell cycle regulation (p53/RB1 loss).  4. Known Drug Response Profiles:  - Sensitive to EGFR/HER2 inhibitors (e.g., lapatinib) and mTOR inhibitors (e.g., everolimus).  - Resistant to conventional chemotherapy (e.g., cisplatin) due to TP53 mutation.  5. Cellular Microenvironment:  - Minimal immune infiltration (low PD-L1 expression).  - Extracellular matrix features typical of aggressive TCC (e.g., high fibronectin).  6. Key Biomarkers:  - Prognostic: TP53 mutation status, HER2 overexpression.  - Therapeutic targets: EGFR, HER2, mTOR.",
    "ACH-000724": "1. Cell type and origin: Epithelial cell line derived from urinary tract; primary disease: bladder carcinoma.  2. Molecular signatures: Harbors mutations in TP53, RB1, and PIK3CA; overexpresses EGFR and HER2.  3. Signaling pathways: PI3K/AKT/mTOR pathway activated; RAS/RAF/MEK/ERK dysregulation; p53 pathway inactivated.  4. Known drug response profiles: Sensitive to EGFR inhibitors (e.g., erlotinib) and PI3K inhibitors; resistant to conventional chemotherapy (e.g., cisplatin).  5. Cellular microenvironment: Minimal immune cell infiltration; high fibronectin and collagen IV in ECM.  6. Key biomarkers: TP53 mutation (prognostic); EGFR/HER2 overexpression (therapeutic targets).",
    "ACH-000802": "1. Cell type and origin: Epithelial cell line derived from bladder carcinoma (urinary tract origin).  2. Molecular signatures: Common mutations in TP53 and RB1; overexpression of EGFR and HER2.  3. Signaling pathways: Hyperactivated PI3K/AKT/mTOR pathway; dysregulated cell cycle due to RB1 loss.  4. Known drug response profiles: Sensitive to EGFR inhibitors (e.g., erlotinib); resistant to conventional cisplatin-based chemotherapy.  5. Cellular microenvironment: Minimal immune cell infiltration; ECM rich in fibronectin and collagen I.  6. Key biomarkers: High levels of survivin (BIRC5) and Ki-67 (proliferation markers); FGFR3 as a potential therapeutic target.",
    "ACH-000896": "1. Cell type and origin: Epithelial cell line derived from urinary tract; primary disease: Bladder Cancer.  2. Molecular signatures: Common mutations in TP53, PIK3CA, and FGFR3; high expression of EGFR and HER2.  3. Signaling pathways: Activated PI3K/AKT/mTOR and MAPK pathways; dysregulated cell cycle progression.  4. Known drug response profiles: Sensitive to FGFR inhibitors (e.g., erdafitinib) and cisplatin; resistant to taxanes.  5. Cellular microenvironment: Limited extracellular matrix interaction; low immune cell infiltration.  6. Key biomarkers: Overexpression of CD44 (cancer stem cell marker); potential therapeutic targets: FGFR3, EGFR.",
    "ACH-000522": "Cell Line: UM-UC-3 (DepMap ID: ACH-000522)  1. Cell Type and Origin: Epithelial cell line derived from human bladder carcinoma; primary tissue source is the urinary tract.  2. Molecular Signatures:  - Common mutations: TP53 (R175H), PIK3CA (E545K), TSC1 (Q688), RB1 loss.  - Overexpression: EGFR, HER2, MMP-9.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR (due to PIK3CA mutation), MAPK/ERK (EGFR-driven), Wnt/β-catenin.  - Inhibited: p53 pathway (TP53 mutation).  4. Known Drug Response Profiles:  - Sensitive: EGFR inhibitors (e.g., erlotinib), PI3K/mTOR inhibitors (e.g., everolimus).  - Resistant: Conventional chemotherapy (e.g., cisplatin) due to TP53 dysfunction.  5. Cellular Microenvironment:  - Extracellular matrix: High collagen and fibronectin deposition.  - Immune cell presence: Low tumor-infiltrating lymphocytes (immune-cold phenotype).  6. Key Biomarkers:  - Prognostic: TP53 mutation (associated with aggressive phenotype).  - Therapeutic targets: EGFR, HER2, PI3K/AKT/mTOR pathway components.",
    "ACH-000018": "1. Cell type and origin: Epithelial cell line derived from urinary tract; primary disease: Bladder Cancer (urothelial carcinoma).  2. Molecular signatures: Common mutations include TP53 (R175H), HRAS (G12V), and PIK3CA (E545K); overexpression of EGFR and HER2.  3. Signaling pathways: Hyperactivated RAS/MAPK and PI3K/AKT pathways due to HRAS and PIK3CA mutations; impaired p53 signaling.  4. Known drug response profiles: Sensitive to EGFR inhibitors (e.g., erlotinib) and MEK inhibitors (e.g., trametinib); resistant to conventional chemotherapy (e.g., cisplatin).  5. Cellular microenvironment: Limited extracellular matrix interaction; low immune cell infiltration (immunologically \"cold\").  6. Key biomarkers: HRAS mutation (G12V) as a therapeutic target; upregulated CD44 and MDR1 associated with drug resistance.",
    "ACH-000486": "Cell Line: KU-19-19 (DepMap ID: ACH-000486)  1. Cell Type and Origin: Derived from bladder cancer; tissue source is the urinary tract.  2. Molecular Signatures: Harbors mutations in TP53 and PIK3CA; exhibits altered expression of epithelial-mesenchymal transition (EMT) markers.  3. Signaling Pathways: Hyperactivation of PI3K/AKT/mTOR pathway; potential dysregulation of cell cycle (RB1 pathway).  4. Known Drug Response Profiles: Sensitive to cisplatin and gemcitabine; resistant to EGFR inhibitors.  5. Cellular Microenvironment: Limited data on immune cell infiltration; likely exhibits an immunosuppressive profile typical of bladder cancer.  6. Key Biomarkers: Overexpression of HER2 and PD-L1; potential therapeutic targets include PI3K and immune checkpoint proteins.",
    "ACH-000545": "1. Cell type and origin: Epithelial cell line derived from urinary tract; primary disease: bladder carcinoma.  2. Molecular signatures: Harbors mutations in TP53, FGFR3, and PIK3CA; overexpresses EGFR and HER2.  3. Signaling pathways: Hyperactivated PI3K/AKT/mTOR and RAS/RAF/MEK pathways; impaired p53 signaling.  4. Known drug response profiles: Sensitive to FGFR inhibitors (e.g., erdafitinib) and EGFR-targeted therapies; resistant to conventional cisplatin-based chemotherapy.  5. Cellular microenvironment: Limited immune cell infiltration; exhibits ECM remodeling with elevated fibronectin and collagen IV.  6. Key biomarkers: FGFR3 alterations (potential therapeutic target); high Ki-67 (proliferation marker); PD-L1 expression (immune checkpoint relevance).",
    "ACH-000621": "### Cell Line Description: MDA-MB-157 (DepMap ID: ACH-000621)  1. Cell Type & Origin  - Triple-negative breast cancer (TNBC) cell line derived from a pleural effusion metastasis.  2. Molecular Signatures  - Mutations: TP53 (R280K), PIK3CA (E545K), PTEN loss.  - Overexpression: EGFR, MET, Vimentin (mesenchymal marker).  - Low/no expression: ER, PR, HER2.  3. Signaling Pathways  - Hyperactivated: PI3K/AKT/mTOR, MAPK, EGFR/MET-driven pathways.  - Impaired: DNA damage repair (TP53 mutation).  4. Known Drug Response Profiles  - Sensitive: PARP inhibitors (due to DNA repair defects), EGFR/MET inhibitors.  - Resistant: Endocrine therapies (ER/PR-negative), HER2-targeted agents.  5. Cellular Microenvironment  - Mesenchymal phenotype (high migratory/invasive potential).  - Limited immune cell infiltration (low PD-L1 expression).  6. Key Biomarkers  - Prognostic: TP53 status, PTEN loss.  - Therapeutic targets: EGFR, MET, PI3K/mTOR.",
    "ACH-000668": "### HCC70 Cell Line Description (DepMap ID: ACH-000668)  1. Cell Type and Origin  - Derived from primary breast adenocarcinoma.  - Triple-negative breast cancer (TNBC) subtype (ER-, PR-, HER2-).  2. Molecular Signatures  - Mutations: TP53 (R196), PIK3CA (H1047R), PTEN loss.  - Amplifications: MYC, CCND1.  - Protein expression: High EGFR, low RB1.  3. Signaling Pathways  - Activated: PI3K/AKT/mTOR (via PIK3CA mutation), MAPK.  - Dysregulated: Cell cycle (CCND1 amplification, RB1 loss).  4. Known Drug Response Profiles  - Sensitive: PARP inhibitors (due to DNA repair defects), PI3K/AKT inhibitors.  - Resistant: Endocrine therapies (ER-/PR-), HER2-targeted agents.  5. Cellular Microenvironment  - Limited immune cell infiltration (typical of TNBC).  - Fibroblast-rich extracellular matrix (collagen-dense).  6. Key Biomarkers  - Prognostic: TP53 mutation (poor prognosis).  - Therapeutic targets: EGFR, PI3K, PARP.",
    "ACH-000910": "Cell Line: MDA-MB-453  1. Cell Type and Origin:  - Derived from metastatic breast adenocarcinoma.  - Tissue source: Pericardial effusion.  2. Molecular Signatures:  - HER2-positive (ERBB2 amplification).  - Mutations in TP53, PIK3CA, and PTEN.  - Overexpression of EGFR and androgen receptor (AR).  3. Signaling Pathways:  - Hyperactivated PI3K/AKT/mTOR pathway due to PIK3CA mutations.  - HER2/ERBB2 signaling drives proliferation.  - AR signaling may contribute to growth.  4. Known Drug Response Profiles:  - Sensitive to HER2-targeted therapies (e.g., lapatinib, trastuzumab).  - Resistant to endocrine therapies (ER-negative).  - Vulnerable to PI3K/AKT inhibitors (e.g., alpelisib).  5. Cellular Microenvironment:  - Limited data on native microenvironment; typically cultured in vitro.  - No significant immune cell infiltration reported in standard models.  6. Key Biomarkers:  - HER2 (prognostic and therapeutic target).  - PTEN loss (predicts PI3K pathway activation).  - AR (potential target in HER2+ breast cancer).",
    "ACH-000699": "1. Cell type and origin: Epithelial cell line derived from a primary ductal carcinoma of the breast (triple-negative breast cancer, TNBC).  2. Molecular signatures:  - Mutations: TP53 (R248Q), PIK3CA (H1047R), PTEN loss.  - Overexpression: EGFR, MYC.  - Copy number alterations: Amplifications in 8q24 (MYC locus), deletions in 10q23 (PTEN locus).  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR (due to PIK3CA mutation, PTEN loss), MAPK/ERK.  - Dysregulated: Cell cycle control (due to TP53 mutation).  4. Known drug response profiles:  - Sensitive to PI3K/AKT/mTOR inhibitors (e.g., everolimus).  - Resistant to endocrine therapies (ER/PR-negative).  - Variable response to PARP inhibitors (BRCA-proficient).  5. Cellular microenvironment:  - Lacks significant stromal or immune cell infiltration in vitro.  - Secretes pro-inflammatory cytokines (e.g., IL-6, IL-8).  6. Key biomarkers:  - Prognostic: High Ki-67 (proliferation marker).  - Therapeutic targets: EGFR, PI3K/AKT/mTOR pathway components.",
    "ACH-000536": "Cell Line: BT-20  1. Cell Type and Origin: Epithelial cell line derived from primary breast adenocarcinoma (triple-negative breast cancer, TNBC).  2. Molecular Signatures:  - Mutations: High-frequency TP53 mutation; lacks ER, PR, and HER2 expression (TNBC).  - Protein expression: Overexpression of EGFR, c-KIT, and VEGFR2.  3. Signaling Pathways:  - Activated: EGFR/PI3K/AKT, MAPK, and JAK/STAT pathways.  - Inhibited: Hormone receptor signaling (ER/PR-negative).  4. Known Drug Response Profiles:  - Sensitive to EGFR inhibitors (e.g., gefitinib), PARP inhibitors, and platinum-based chemotherapies.  - Resistant to endocrine therapies (e.g., tamoxifen) and HER2-targeted agents.  5. Cellular Microenvironment:  - Limited stromal interaction in vitro; low immune cell infiltration (typical of TNBC models).  6. Key Biomarkers:  - Prognostic: TP53 mutation status, EGFR expression.  - Therapeutic targets: EGFR, PARP, PD-L1 (moderate expression).",
    "ACH-000111": "Cell Line Description: HCC1187 (DepMap ID: ACH-000111)  1. Cell Type and Origin: Epithelial cell line derived from primary breast adenocarcinoma (triple-negative breast cancer, TNBC).  2. Molecular Signatures:  - Mutations: TP53 (R175H), PIK3CA (E545K), PTEN loss.  - Amplifications: MYC, EGFR.  - Protein expression: High EGFR, low ER/PR/HER2 (TNBC phenotype).  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR (due to PIK3CA mutation, PTEN loss), EGFR/MAPK.  - Inhibited: p53 pathway (TP53 mutation).  4. Known Drug Response Profiles:  - Sensitive: PARP inhibitors (BRCA1/2 wildtype but homologous repair deficiency), EGFR inhibitors.  - Resistant: Endocrine therapies (ER/PR-negative), HER2-targeted agents.  5. Cellular Microenvironment:  - Minimal stromal contamination; low immune cell infiltration (typical of TNBC models).  - ECM composition: Fibronectin-rich, collagen I/IV present.  6. Key Biomarkers:  - Prognostic: High Ki-67 (proliferation marker).  - Therapeutic targets: EGFR, PI3K, PARP.",
    "ACH-000212": "1. Cell type and origin: CAL-120 is a breast cancer cell line derived from a pleural effusion.  2. Molecular signatures: Harbors mutations in PIK3CA (H1047R) and TP53. Overexpresses HER2 and EGFR.  3. Signaling pathways: Activated PI3K/AKT/mTOR pathway due to PIK3CA mutation. Dysregulated p53 signaling from TP53 mutation.  4. Known drug response profiles: Sensitive to PI3K inhibitors (e.g., alpelisib) and HER2-targeted therapies (e.g., trastuzumab). Resistant to endocrine therapies (e.g., tamoxifen).  5. Cellular microenvironment: Derived from pleural effusion, suggesting adaptation to fluid-phase growth. Limited data on extracellular matrix or immune cell interactions.  6. Key biomarkers: HER2 (therapeutic target), mutant PIK3CA (predictive for PI3K inhibitors), mutant TP53 (prognostic marker).",
    "ACH-000352": "1. Cell type and origin: Epithelial cell line derived from a pleural effusion of a breast adenocarcinoma (luminal subtype).  2. Molecular signatures:  - Mutations: PIK3CA (H1047R), TP53 (R273H), GATA3 (splice site), and MAP3K1 (E1028).  - Amplifications: ERBB2 (HER2), CCND1, and MYC.  - Protein expression: High ER (ESR1), PR (PGR), and HER2 expression.  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR (due to PIK3CA mutation), ERα signaling (hormone-responsive), and HER2 signaling.  - Dysregulated: Cell cycle (via CCND1 amplification) and apoptosis (via TP53 mutation).  4. Known drug response profiles:  - Sensitive to HER2-targeted therapies (e.g., trastuzumab, lapatinib) and endocrine therapies (e.g., tamoxifen, fulvestrant).  - Resistant to single-agent chemotherapy (e.g., paclitaxel) due to survival pathway activation.  5. Cellular microenvironment:  - Derived from metastatic site (pleural effusion), suggesting adaptation to fluid-phase growth.  - Limited data on extracellular matrix or immune interactions in culture.  6. Key biomarkers:  - Prognostic: HER2+, ER/PR+ (luminal subtype).  - Therapeutic targets: HER2, ER, PI3K, CDK4/6 (via CCND1).",
    "ACH-000856": "1. Cell type and origin: Epithelial cell line derived from pleural effusion of invasive breast carcinoma (triple-negative breast cancer, TNBC).  2. Molecular signatures:  - Mutations: PIK3CA (H1047R), TP53 (R248Q), PTEN loss.  - Amplifications: MYC, CCND1.  - Protein expression: Low ER/PR/HER2, high EGFR and MET.  3. Signaling pathways:  - Hyperactive PI3K/AKT/mTOR due to PIK3CA mutation.  - Dysregulated cell cycle (CDK4/6-cyclin D1).  - RAS/RAF/MEK/ERK pathway activation.  4. Known drug response profiles:  - Sensitive to PI3K/mTOR inhibitors (e.g., alpelisib, everolimus).  - Resistant to endocrine therapies (tamoxifen, aromatase inhibitors).  - Variable response to chemotherapy (paclitaxel sensitivity, cisplatin resistance).  5. Cellular microenvironment:  - Derived from metastatic site (pleural effusion), suggesting adaptive survival mechanisms.  - Limited data on immune infiltrates; likely low immunogenicity (TNBC).  6. Key biomarkers:  - PIK3CA mutation (predictive for PI3K inhibitors).  - EGFR/MET overexpression (potential targeted therapy candidates).  - PTEN loss (prognostic for aggressive behavior).",
    "ACH-000624": "1. Cell type and origin: Epithelial cell line derived from primary breast adenocarcinoma (triple-negative breast cancer, TNBC).  2. Molecular signatures:  - Mutations: TP53 (R248W), PIK3CA (H1047R), PTEN loss.  - Protein expression: Low ER/PR/HER2 (TNBC), high EGFR, cytokeratin 5/6+.  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR (PIK3CA mutation, PTEN loss), EGFR/RAS/MAPK.  - Inhibited: Hormone receptor signaling (ER/PR-negative).  4. Known drug response profiles:  - Sensitive: PARP inhibitors (BRCA-proficient but HRD-like), EGFR inhibitors.  - Resistant: Endocrine therapies (ER/PR-negative), HER2-targeted agents.  5. Cellular microenvironment:  - Limited immune infiltration (low PD-L1 expression).  - Fibroblast-rich extracellular matrix (high collagen deposition).  6. Key biomarkers:  - Prognostic: TP53 mutation (poor prognosis).  - Therapeutic targets: EGFR, PI3K, PARP (synthetic lethality in HRD context).",
    "ACH-000223": "Cell Line: HCC1937 (DepMap ID: ACH-000223)  1. Cell Type and Origin: Epithelial cell line derived from primary breast adenocarcinoma (triple-negative breast cancer, TNBC).  2. Molecular Signatures:  - Homozygous BRCA1 mutation (5382insC), TP53 mutation (R175H).  - Loss of PTEN expression, HER2-negative, ER/PR-negative.  3. Signaling Pathways:  - Dysregulated DNA repair due to BRCA1 deficiency.  - Hyperactivated PI3K/AKT/mTOR pathway (PTEN loss).  - Impaired cell cycle control (TP53 mutation).  4. Known Drug Response Profiles:  - Sensitive to PARP inhibitors (e.g., olaparib) due to BRCA1 deficiency.  - Resistance to conventional endocrine therapies (ER/PR-negative).  - Potential sensitivity to PI3K/AKT/mTOR inhibitors.  5. Cellular Microenvironment:  - Limited data on native microenvironment; typically cultured as a monolayer.  - No significant immune cell infiltration reported in vitro.  6. Key Biomarkers:  - BRCA1 mutation (predicts PARP inhibitor sensitivity).  - PTEN loss (prognostic for aggressive phenotype).  - TP53 mutation (associated with chemoresistance).",
    "ACH-000276": "Cell Line: HCC38 (DepMap ID: ACH-000276)  1. Cell type and origin: Derived from primary breast adenocarcinoma; triple-negative breast cancer (TNBC) subtype.  2. Molecular signatures:  - Mutations: TP53 (R248Q), PIK3CA (H1047R), PTEN loss.  - Protein expression: High EGFR, low HER2, ER/PR-negative.  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR (PIK3CA-driven), RAS/RAF/MEK.  - Inhibited: Hormone receptor signaling (ER/PR-negative).  4. Known drug response profiles:  - Sensitive: PI3K inhibitors (e.g., alpelisib), PARP inhibitors (e.g., olaparib).  - Resistant: Endocrine therapies (e.g., tamoxifen).  5. Cellular microenvironment:  - Limited immune cell infiltration (low PD-L1 expression).  - Fibroblast-rich extracellular matrix.  6. Key biomarkers:  - Prognostic: TP53 mutation, PTEN loss.  - Therapeutic targets: EGFR, PI3K/AKT/mTOR pathway.",
    "ACH-000374": "Cell Line: HCC1143 (DepMap ID: ACH-000374)  1. Cell Type and Origin: Triple-negative breast cancer (TNBC) cell line derived from primary breast adenocarcinoma tissue.  2. Molecular Signatures:  - Mutations: TP53 (R175H), PIK3CA (H1047R), PTEN loss.  - Protein expression: High EGFR, low HER2, absent ER/PR.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR (due to PIK3CA mutation), EGFR/RAS/MAPK.  - Inhibited: ER/PR signaling (hormone receptor-negative).  4. Known Drug Response Profiles:  - Sensitive: PARP inhibitors (due to homologous recombination deficiency), EGFR inhibitors.  - Resistant: Endocrine therapies (e.g., tamoxifen, aromatase inhibitors).  5. Cellular Microenvironment:  - Minimal immune cell infiltration (typical for TNBC models).  - Extracellular matrix interactions mediated by integrins and MMPs.  6. Key Biomarkers:  - Prognostic: TP53 mutation status, Ki-67 (high proliferative index).  - Therapeutic targets: EGFR, PARP, PI3K.",
    "ACH-001819": "1. Cell type and origin: Epithelial cell line derived from pleural effusion of a breast cancer patient; luminal subtype.  2. Molecular signatures:  - Mutations: ESR1 Y537S (constitutively active), PIK3CA E545K.  - Protein expression: ERα-positive, HER2-negative, androgen receptor (AR)-positive.  3. Signaling pathways:  - Hyperactive PI3K/AKT/mTOR due to PIK3CA mutation.  - Ligand-independent ERα signaling via ESR1 Y537S.  - AR signaling may contribute to growth.  4. Known drug response profiles:  - Sensitive to ER antagonists (e.g., fulvestrant), PI3K inhibitors (e.g., alpelisib).  - Resistant to tamoxifen due to ESR1 mutation.  5. Cellular microenvironment:  - Derived from metastatic site (pleural effusion), suggesting adaptation to fluid-phase conditions.  - Minimal documented immune cell interaction in vitro.  6. Key biomarkers:  - ESR1 Y537S (predicts endocrine resistance).  - PIK3CA E545K (predicts PI3K inhibitor sensitivity).  - AR (potential secondary target).",
    "ACH-001390": "Cell Line: SUM149PT  1. Cell Type and Origin:  - Derived from primary breast adenocarcinoma (triple-negative breast cancer, TNBC).  - Tissue source: Inflammatory breast cancer.  2. Molecular Signatures:  - Mutations: BRCA1 loss, TP53 mutation (R248W), PTEN deletion.  - Protein expression: EGFR+, HER2-, ER-, PR-.  3. Signaling Pathways:  - Hyperactivated PI3K/AKT/mTOR due to PTEN loss.  - Dysregulated DNA repair (BRCA1-deficient).  - NF-κB pathway activation (inflammatory phenotype).  4. Known Drug Response Profiles:  - Sensitive to PARP inhibitors (olaparib) due to BRCA1 deficiency.  - Resistant to endocrine therapies (ER-/PR-).  - Responsive to EGFR-targeted therapies (e.g., gefitinib).  5. Cellular Microenvironment:  - Inflammatory tumor microenvironment (high IL-6, IL-8 secretion).  - Limited immune cell infiltration in vitro models.  6. Key Biomarkers:  - BRCA1 deficiency (predicts PARPi sensitivity).  - EGFR overexpression (therapeutic target).  - PTEN loss (prognostic for PI3K pathway activation).",
    "ACH-000902": "Cell Line: CAL-148 (DepMap ID: ACH-000902)  1. Cell Type and Origin: Epithelial cell line derived from pleural effusion of metastatic breast cancer (triple-negative subtype).  2. Molecular Signatures:  - Mutations: TP53 (R248Q), PIK3CA (H1047R), PTEN loss.  - Protein expression: High EGFR, moderate HER2-negative, low ER/PR.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR (PIK3CA-driven), RAS/RAF/MEK.  - Inhibited: p53 pathway (TP53 mutation).  4. Drug Response Profiles:  - Sensitive: PI3K inhibitors (e.g., alpelisib), PARP inhibitors (e.g., olaparib).  - Resistant: Endocrine therapies (e.g., tamoxifen), HER2-targeted agents.  5. Cellular Microenvironment:  - Minimal immune cell infiltration (low PD-L1 expression).  - Extracellular matrix: Fibronectin-rich, moderate hypoxic stress.  6. Key Biomarkers:  - Prognostic: PTEN loss (aggressive phenotype).  - Therapeutic targets: EGFR, PI3K/AKT/mTOR, PARP.",
    "ACH-000480": "1. Cell type and origin: Hepatocellular carcinoma (HCC) cell line derived from liver tissue.  2. Molecular signatures:  - Common mutations: TP53 (R249S), CTNNB1 (mutated in some sublines), TERT promoter mutations.  - Overexpression: AFP, MET, EGFR.  - Frequent alterations: Wnt/β-catenin pathway, PI3K/AKT/mTOR axis.  3. Signaling pathways:  - Activated: Ras/Raf/MEK/ERK, PI3K/AKT, Wnt/β-catenin.  - Inhibited: p53-mediated apoptosis due to TP53 mutation.  4. Known drug response profiles:  - Sensitive: Sorafenib (variable), regorafenib, MET inhibitors (e.g., crizotinib).  - Resistant: 5-FU, conventional chemotherapies (e.g., cisplatin).  5. Cellular microenvironment:  - Limited extracellular matrix interaction in vitro; low immune cell presence (standard 2D culture conditions).  6. Key biomarkers:  - Prognostic: AFP (elevated), MET (prognostic for invasiveness).  - Therapeutic targets: MET, EGFR, VEGF.",
    "ACH-000258": "### DU4475 Cell Line Description  1. Cell Type and Origin  - Derived from metastatic skin lesion of breast adenocarcinoma (triple-negative breast cancer, TNBC).  2. Molecular Signatures  - Mutations: TP53 (common in TNBC), PIK3CA, PTEN loss.  - Protein expression: Low ER/PR/HER2, high EGFR, c-KIT.  3. Signaling Pathways  - Hyperactivated PI3K/AKT/mTOR pathway.  - Dysregulated MAPK/ERK signaling.  - Elevated JAK/STAT activity.  4. Known Drug Response Profiles  - Sensitive to PI3K/mTOR inhibitors (e.g., everolimus).  - Resistant to endocrine therapies (ER-negative).  - Variable response to chemotherapy (e.g., paclitaxel).  5. Cellular Microenvironment  - Stroma-rich origin suggests ECM interactions (collagen, fibronectin).  - Limited immune infiltration (low PD-L1 expression).  6. Key Biomarkers  - Prognostic: Ki-67 (high proliferation index).  - Therapeutic targets: EGFR, c-KIT, PI3K pathway components.",
    "ACH-000007": "Cell Line: LS513 (DepMap ID: ACH-000007)  1. Cell Type and Origin: Colorectal adenocarcinoma derived from large intestine tissue.  2. Molecular Signatures:  - Mutations: APC, TP53, KRAS (common in colorectal cancer).  - Protein expression: High EGFR, moderate HER2, low PTEN.  3. Signaling Pathways:  - Activated: Wnt/β-catenin (APC mutation), MAPK/ERK (KRAS mutation).  - Inhibited: PI3K/AKT (PTEN loss).  4. Known Drug Response Profiles:  - Sensitive: EGFR inhibitors (cetuximab), MEK inhibitors (trametinib).  - Resistant: 5-FU (fluorouracil), conventional chemotherapy.  5. Cellular Microenvironment:  - Extracellular matrix: High collagen deposition.  - Immune cell presence: Low tumor-infiltrating lymphocytes (TILs).  6. Key Biomarkers:  - Prognostic: KRAS mutation (predicts resistance to EGFR inhibitors).  - Therapeutic targets: EGFR, MEK.",
    "ACH-000958": "1. Cell type and origin: Epithelial cell line derived from a primary colon adenocarcinoma (Colorectal Cancer).  2. Molecular signatures:  - Mutations: APC (truncating), TP53 (missense), KRAS (G12V), PIK3CA (E545K).  - Microsatellite instability-high (MSI-H) due to MLH1 promoter hypermethylation.  - Moderate EGFR expression, low HER2 expression.  3. Signaling pathways:  - Hyperactivated WNT/β-catenin (APC loss).  - Constitutive MAPK/ERK activation (KRAS mutation).  - PI3K/AKT/mTOR dysregulation (PIK3CA mutation).  4. Known drug response profiles:  - Resistant to EGFR inhibitors (cetuximab, panitumumab) due to KRAS mutation.  - Sensitive to MEK inhibitors (trametinib).  - Potential sensitivity to PI3K/mTOR inhibitors.  5. Cellular microenvironment:  - Low immune infiltration in vitro (limited immune cell presence).  - Minimal extracellular matrix interaction in standard 2D culture.  6. Key biomarkers:  - MSI-H status (predictive of immunotherapy response).  - KRAS G12V (therapeutic target for KRAS inhibitors).  - APC loss (WNT pathway biomarker).",
    "ACH-000403": "1. Cell type and origin: NCI-H747 is a human colorectal adenocarcinoma cell line derived from the large intestine, modeling Colon/Colorectal Cancer.  2. Molecular signatures: Harbors common CRC mutations (e.g., APC, KRAS, TP53). Overexpresses EGFR and HER2; microsatellite stable (MSS).  3. Signaling pathways: Hyperactivated MAPK/ERK (via KRAS mutation), dysregulated Wnt/β-catenin (APC mutation), and PI3K/AKT/mTOR pathways.  4. Known drug response profiles: Sensitive to EGFR inhibitors (cetuximab) but resistant due to KRAS mutation. Responds to MEK inhibitors (trametinib) and chemotherapies (5-FU, oxaliplatin).  5. Cellular microenvironment: Lacks significant immune infiltration (low PD-L1). Cultured as adherent monolayers with minimal extracellular matrix modeling.  6. Key biomarkers: KRAS (G12V), APC (truncating), TP53 (R273H); high CEA and CA19-9 expression. EGFR/HER2 as therapeutic targets.",
    "ACH-000680": "1. Cell type and origin: Epithelial cell line derived from colorectal adenocarcinoma (Colon/Colorectal Cancer).  2. Molecular signatures:  - Common mutations: _TP53_ (R273H), _KRAS_ (G12V), _PIK3CA_ (E545K).  - Microsatellite stable (MSS), chromosomal instability (CIN) phenotype.  3. Signaling pathways:  - Hyperactivated MAPK/ERK (via _KRAS_ mutation).  - Dysregulated PI3K/AKT/mTOR (via _PIK3CA_ mutation).  - Impaired p53-mediated apoptosis.  4. Known drug response profiles:  - Resistant to EGFR inhibitors (e.g., cetuximab) due to _KRAS_ mutation.  - Sensitive to MEK inhibitors (e.g., trametinib) and PI3K/mTOR inhibitors.  5. Cellular microenvironment:  - Low immune infiltration (e.g., minimal PD-L1 expression).  - Extracellular matrix rich in collagen and fibronectin.  6. Key biomarkers:  - _KRAS_ G12V (therapeutic target for RAS pathway inhibitors).  - Overexpression of cyclin D1 (proliferation marker).  - Low MSI (microsatellite stable) status.",
    "ACH-000820": "Cell Line: SW403 (DepMap ID: ACH-000820)  1. Cell Type and Origin:  - Derived from colon adenocarcinoma (primary disease: Colon/Colorectal Cancer).  - Tissue source: Colon.  2. Molecular Signatures:  - Common mutations: APC (truncating), TP53 (missense), KRAS (G12V).  - Microsatellite stable (MSS).  - Moderate expression of EGFR, HER2, and MYC.  3. Signaling Pathways:  - Hyperactivated WNT/β-catenin pathway (due to APC loss).  - Constitutively active MAPK/ERK pathway (KRAS-driven).  - Dysregulated PI3K/AKT/mTOR signaling.  4. Known Drug Response Profiles:  - Resistant to anti-EGFR therapies (due to KRAS mutation).  - Sensitive to MEK inhibitors (e.g., trametinib) and PI3K/mTOR inhibitors.  - Moderate response to 5-FU and oxaliplatin.  5. Cellular Microenvironment:  - Low immune infiltration (cold tumor phenotype).  - Extracellular matrix rich in collagen and fibronectin.  6. Key Biomarkers:  - Prognostic: KRAS G12V, TP53 mutation.  - Therapeutic targets: MEK, PI3K, mTOR, HER2.",
    "ACH-000169": "1. Cell type and origin:  - Embryonal rhabdomyosarcoma (soft tissue sarcoma) derived from skeletal muscle lineage.  2. Molecular signatures:  - Characterized by PAX3-FOXO1 fusion gene (alveolar subtype mimic).  - Overexpression of MYOD1 and MYOG (myogenic differentiation markers).  - Common mutations in TP53, NRAS, and PI3K pathway genes.  3. Signaling pathways:  - Hyperactivated PI3K/AKT/mTOR pathway.  - Dysregulated IGF-1R signaling.  - WNT/β-catenin pathway alterations.  4. Known drug response profiles:  - Sensitive to IGF-1R inhibitors (e.g., linsitinib).  - Resistant to conventional chemotherapies (e.g., vincristine, actinomycin D).  - Responsive to PI3K/mTOR inhibitors (e.g., rapamycin analogs).  5. Cellular microenvironment:  - Limited immune infiltration (low PD-L1 expression).  - Fibronectin-rich extracellular matrix.  6. Key biomarkers:  - PAX3-FOXO1 fusion (diagnostic/therapeutic target).  - MYOD1 (prognostic marker).  - CDK4/6 overexpression (potential therapeutic vulnerability).",
    "ACH-000530": "1. Cell type and origin: DMS 114 is a small cell lung cancer (SCLC) cell line derived from a metastatic site in the lung.  2. Molecular signatures:  - Common SCLC mutations (e.g., TP53, RB1 inactivation).  - High expression of neuroendocrine markers (e.g., ASCL1, SYP, CHGA).  - Amplification of MYC family genes (e.g., MYCL) in some variants.  3. Signaling pathways:  - Activated Notch and Hedgehog pathways.  - Dysregulated PI3K/AKT/mTOR signaling.  - Loss of RB1 leads to E2F-dependent proliferation.  4. Known drug response profiles:  - Sensitive to platinum-based chemotherapies (e.g., cisplatin).  - Resistance to EGFR inhibitors due to lack of EGFR mutations.  - Vulnerable to PARP inhibitors and BCL-2 antagonists.  5. Cellular microenvironment:  - Minimal extracellular matrix interaction in vitro.  - Low immune cell infiltration (immune-cold phenotype).  6. Key biomarkers:  - Prognostic: Elevated levels of neuron-specific enolase (NSE).  - Therapeutic targets: DLL3 (Notch ligand), BCL-2, PARP.",
    "ACH-000747": "Cell Line: NCI-H1703  1. Cell Type and Origin: Non-small cell lung carcinoma (NSCLC), derived from lung tissue.  2. Molecular Signatures:  - Mutations: TP53 (R158L), CDKN2A loss, STK11 (L110P).  - Protein expression: High EGFR, moderate MET, low PD-L1.  3. Signaling Pathways:  - Activated: PI3K/AKT (via STK11 mutation), RAS/RAF.  - Inhibited: p53 pathway (due to TP53 mutation).  4. Known Drug Response Profiles:  - Sensitive to EGFR inhibitors (e.g., erlotinib), MET inhibitors.  - Resistant to immune checkpoint inhibitors (low PD-L1).  5. Cellular Microenvironment:  - Low immune infiltration (minimal T-cell presence).  - Fibronectin-rich extracellular matrix.  6. Key Biomarkers:  - Prognostic: TP53 mutation (poor prognosis).  - Therapeutic targets: EGFR, MET.",
    "ACH-001196": "Cell Line: SMS-CTR (DepMap ID: ACH-001196)  1. Cell Type and Origin:  - Derived from soft tissue sarcoma (primary disease: Sarcoma).  2. Molecular Signatures:  - Genetic mutations and protein expression profiles typical of sarcomas (specific mutations not detailed in DepMap).  3. Signaling Pathways:  - Likely dysregulation in pathways common to sarcomas (e.g., PI3K/AKT, MAPK, Wnt/β-catenin).  4. Known Drug Response Profiles:  - Sensitivity/resistance data available in DepMap; may exhibit resistance to standard chemotherapies.  5. Cellular Microenvironment:  - Soft tissue origin suggests interaction with fibroblasts and extracellular matrix components; immune cell presence not specified.  6. Key Biomarkers:  - Potential biomarkers include overexpression of sarcoma-associated antigens (e.g., NY-ESO-1) or mutations in TP53, RB1.",
    "ACH-001396": "1. Cell type and origin: Epithelial cell line derived from pleural effusion of invasive lobular breast carcinoma.  2. Molecular signatures:  - Mutations: PIK3CA (H1047R), TP53 (R273C), CDH1 loss (E-cadherin negative).  - Amplifications: ERBB2 (HER2), FGFR1.  - Protein expression: ER/PR-negative, HER2-positive.  3. Signaling pathways:  - Hyperactivated PI3K/AKT/mTOR due to PIK3CA mutation.  - HER2-driven MAPK/ERK signaling.  - Impaired cell adhesion via CDH1 loss.  4. Known drug response profiles:  - Sensitive to HER2-targeted therapies (e.g., lapatinib, trastuzumab).  - Resistant to endocrine therapies (ER/PR-negative).  - Potential sensitivity to PI3K/AKT inhibitors (e.g., alpelisib).  5. Cellular microenvironment:  - Derived from metastatic site (pleural effusion), suggesting adaptation to fluid-phase growth.  - Limited extracellular matrix interaction in suspension culture.  6. Key biomarkers:  - HER2 overexpression (therapeutic target).  - PIK3CA mutation (predictor of PI3K inhibitor response).  - E-cadherin loss (prognostic for invasive phenotype).",
    "ACH-000582": "1. Cell type and origin: COLO 741 is a human skin cancer cell line derived from a malignant melanoma.  2. Molecular signatures: Harbors mutations in BRAF (V600E), NRAS, and PTEN, with overexpression of MITF and cyclin D1.  3. Signaling pathways: Hyperactivated MAPK/ERK pathway due to BRAF mutation; PI3K/AKT pathway dysregulation from PTEN loss.  4. Known drug response profiles: Sensitive to BRAF inhibitors (e.g., vemurafenib) but prone to resistance; resistant to single-agent MEK inhibitors.  5. Cellular microenvironment: Exhibits moderate extracellular matrix interaction; limited immune cell infiltration in vitro.  6. Key biomarkers: BRAF V600E as a primary therapeutic target; elevated S100B and MART-1 as melanoma markers.",
    "ACH-001458": "1. Cell type and origin: C75 is a colorectal adenocarcinoma cell line derived from the large intestine, representing colon/colorectal cancer.  2. Molecular signatures: Likely harbors common colorectal cancer mutations (e.g., APC, KRAS, TP53, or PIK3CA). Potential microsatellite instability (MSI) or chromosomal instability (CIN) phenotypes.  3. Signaling pathways: Hyperactivated Wnt/β-catenin (due to APC mutations), MAPK/ERK (KRAS-driven), and PI3K/AKT pathways. Potential TGF-β resistance.  4. Known drug response profiles: Sensitive to EGFR inhibitors if KRAS wild-type; resistant to 5-FU if mismatch repair-deficient. May respond to MEK or BRAF inhibitors depending on mutational profile.  5. Cellular microenvironment: Minimal native immune infiltration (standard for in vitro models). ECM composition may include collagen I/IV and fibronectin.  6. Key biomarkers: Potential biomarkers include KRAS mutation status, MSI phenotype, CEA (carcinoembryonic antigen), and CDX2 expression. Therapeutic targets may include EGFR, HER2, or VEGF pathways.",
    "ACH-000860": "Cell Line: NCI-H358  1. Cell Type and Origin: Non-small cell lung cancer (NSCLC) cell line derived from lung tissue.  2. Molecular Signatures:  - KRAS G12C mutation.  - TP53 mutation (common in NSCLC).  - Low/no expression of EGFR.  - Overexpression of survivin (BIRC5).  3. Signaling Pathways:  - Hyperactivated MAPK/ERK pathway (KRAS-driven).  - PI3K/AKT pathway activation.  - Impaired p53-mediated apoptosis.  4. Known Drug Response Profiles:  - Sensitive to MEK inhibitors (e.g., trametinib).  - Resistant to EGFR inhibitors (e.g., erlotinib).  - Potential sensitivity to KRAS G12C inhibitors (e.g., sotorasib).  5. Cellular Microenvironment:  - Epithelial origin with adherent growth.  - Limited immune cell interaction in vitro.  - Extracellular matrix interactions typical of NSCLC models.  6. Key Biomarkers:  - KRAS G12C (therapeutic target).  - BIRC5 (prognostic marker).  - PD-L1 expression (variable, potential immunotherapeutic relevance).",
    "ACH-000837": "Cell Line: NCI-H322  1. Cell Type and Origin: Non-small cell lung cancer (NSCLC) cell line derived from a lung adenocarcinoma.  2. Molecular Signatures:  - Mutations: KRAS (G12C), TP53 (R273H), STK11 (loss).  - Protein expression: High EGFR, moderate MET, low PD-L1.  3. Signaling Pathways:  - Activated: KRAS/MAPK, PI3K/AKT.  - Inhibited: LKB1/AMPK (due to STK11 loss).  4. Known Drug Response Profiles:  - Sensitive: MEK inhibitors (trametinib), EGFR inhibitors (erlotinib, with resistance potential).  - Resistant: Single-agent immunotherapy (anti-PD-1).  5. Cellular Microenvironment:  - Low immune infiltration (minimal T-cell presence).  - Fibronectin-rich extracellular matrix.  6. Key Biomarkers:  - Prognostic: KRAS mutation status.  - Therapeutic targets: EGFR, MET, MEK.",
    "ACH-000785": "Cell Line: NCI-H2126  1. Cell Type and Origin: Non-small cell lung cancer (NSCLC) cell line derived from haematopoietic and lymphoid tissue (likely metastatic origin).  2. Molecular Signatures:  - Mutations: KRAS (G12C), STK11, TP53.  - Protein expression: High EGFR, moderate MET expression.  3. Signaling Pathways:  - Activated: KRAS/MAPK, PI3K/AKT (due to STK11 loss).  - Inhibited: LKB1/AMPK (STK11 mutation).  4. Known Drug Response Profiles:  - Sensitive: MEK inhibitors (trametinib), KRAS-G12C inhibitors (sotorasib).  - Resistant: EGFR TKIs (erlotinib, gefitinib).  5. Cellular Microenvironment:  - Limited extracellular matrix interaction (suspension-adapted).  - Low immune cell infiltration (minimal PD-L1 expression).  6. Key Biomarkers:  - Prognostic: KRAS mutation (poor prognosis).  - Therapeutic targets: KRAS-G12C, MET.",
    "ACH-000718": "Cell Line: NCI-H2291  1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from a lymph node metastasis.  2. Molecular signatures: Harbors mutations in KRAS (G12V), TP53, and STK11; expresses high levels of EGFR and MET.  3. Signaling pathways: Hyperactivation of MAPK/ERK (via KRAS), impaired AMPK signaling (via STK11), and PI3K/AKT pathway dysregulation.  4. Known drug response profiles: Sensitive to MEK inhibitors (e.g., trametinib), resistant to single-agent EGFR inhibitors (e.g., gefitinib).  5. Cellular microenvironment: Lymph node-derived, suggesting potential stromal and immune interactions (e.g., fibroblast/lymphocyte co-culture models).  6. Key biomarkers: KRAS G12V (driver mutation), MET amplification (therapeutic target), PD-L1 expression (immune checkpoint marker).",
    "ACH-000447": "Cell Line: NCI-H2228  1. Cell Type and Origin: Non-small cell lung cancer (NSCLC) cell line derived from lung tissue.  2. Molecular Signatures:  - EML4-ALK fusion (variant 3, E6;A20) driving oncogenic activity.  - Mutations in TP53 and CDKN2A.  - Overexpression of ALK and MET proteins.  3. Signaling Pathways:  - Hyperactivation of ALK and downstream MAPK/ERK, PI3K/AKT, and JAK/STAT pathways.  - MET pathway involvement contributing to resistance mechanisms.  4. Known Drug Response Profiles:  - Sensitive to ALK inhibitors (e.g., crizotinib, alectinib).  - Resistance to EGFR inhibitors (e.g., erlotinib, gefitinib).  - Potential sensitivity to MET inhibitors (e.g., capmatinib) in combination therapies.  5. Cellular Microenvironment:  - Limited data on immune cell infiltration; typically cultured as a monolayer.  - Extracellular matrix interactions may influence metastatic behavior.  6. Key Biomarkers:  - EML4-ALK fusion as a primary therapeutic target.  - TP53 mutation as a prognostic marker for aggressiveness.  - MET overexpression as a potential resistance biomarker.",
    "ACH-000481": "Cell Line: NCI-H2170  1. Cell Type and Origin: Non-small cell lung cancer (NSCLC) cell line derived from a lung adenocarcinoma.  2. Molecular Signatures: Harbors mutations in KRAS (G12V), TP53, and STK11; exhibits moderate EGFR expression but lacks activating mutations.  3. Signaling Pathways: Hyperactivated MAPK/ERK pathway due to KRAS mutation; mTOR signaling dysregulated via STK11 loss.  4. Known Drug Response Profiles: Sensitive to MEK inhibitors (e.g., trametinib) and resistant to EGFR inhibitors (e.g., erlotinib).  5. Cellular Microenvironment: Minimal endogenous immune cell interactions in vitro; ECM composition typical of epithelial-derived tumors.  6. Key Biomarkers: KRAS G12V as a primary driver mutation; low PD-L1 expression, suggesting limited immune checkpoint blockade response.",
    "ACH-000892": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from lung tissue.  2. Molecular signatures: Common mutations include KRAS G12C and STK11 loss; moderate PD-L1 expression.  3. Signaling pathways: Hyperactivated MAPK/ERK pathway due to KRAS mutation; mTOR pathway dysregulation from STK11 loss.  4. Known drug response profiles: Sensitive to MEK inhibitors (e.g., trametinib); resistant to EGFR-targeted therapies.  5. Cellular microenvironment: Low immune infiltration in vitro; ECM composition typical of aggressive NSCLC.  6. Key biomarkers: KRAS G12C (therapeutic target); STK11 loss (prognostic for resistance to immunotherapy).",
    "ACH-000451": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from lung tissue.  2. Molecular signatures: Harbors mutations in KRAS (G12C) and TP53; expresses high levels of EGFR and MET.  3. Signaling pathways: Hyperactivation of MAPK/ERK (via KRAS mutation) and PI3K/AKT pathways; Wnt/β-catenin pathway dysregulation.  4. Known drug response profiles: Sensitive to MEK inhibitors (e.g., trametinib) and MET inhibitors (e.g., crizotinib); resistant to EGFR TKIs (e.g., erlotinib).  5. Cellular microenvironment: Limited data on immune cell infiltration; exhibits autocrine signaling via HGF/MET axis.  6. Key biomarkers: KRAS G12C (therapeutic target), MET overexpression (prognostic marker), PD-L1 negative.",
    "ACH-000587": "Cell Line: NCI-H1975  1. Cell Type and Origin: Non-small cell lung cancer (NSCLC) cell line derived from lung adenocarcinoma.  2. Molecular Signatures: Harbors EGFR L858R and T790M mutations; KRAS wild-type; moderate MET expression.  3. Signaling Pathways: Hyperactivated EGFR signaling via mutant EGFR; PI3K/AKT and MAPK pathways dysregulated.  4. Known Drug Response Profiles: Resistant to first-generation EGFR inhibitors (e.g., gefitinib); sensitive to osimertinib (third-generation EGFR inhibitor).  5. Cellular Microenvironment: Low immune cell infiltration in vitro; extracellular matrix interactions may influence EGFR inhibitor resistance.  6. Key Biomarkers: EGFR mutations (L858R/T790M) as primary therapeutic targets; MET amplification as a resistance marker.",
    "ACH-000888": "Cell Line: NCI-H1793  1. Cell Type and Origin: Non-small cell lung cancer (NSCLC) cell line derived from a lung adenocarcinoma.  2. Molecular Signatures: Harbors mutations in KRAS (G12C), TP53, and STK11; moderate EGFR expression without activating mutations.  3. Signaling Pathways: Hyperactive MAPK/ERK pathway due to KRAS mutation; mTOR pathway dysregulation linked to STK11 loss.  4. Known Drug Response Profiles: Sensitive to MEK inhibitors (e.g., trametinib); resistant to EGFR TKIs (e.g., erlotinib).  5. Cellular Microenvironment: Limited data on immune infiltration; likely exhibits low PD-L1 expression.  6. Key Biomarkers: KRAS G12C (therapeutic target); STK11 loss (prognostic for mTOR inhibitor response).",
    "ACH-000589": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from a pleural effusion.  2. Molecular signatures: Harbors mutations in KRAS (G12C), STK11, and TP53; exhibits high expression of EGFR and MET.  3. Signaling pathways: Hyperactivated MAPK/ERK and PI3K/AKT pathways due to KRAS mutation; impaired AMPK signaling from STK11 loss.  4. Known drug response profiles: Sensitive to MEK inhibitors (e.g., trametinib) and MET inhibitors (e.g., crizotinib); resistant to EGFR TKIs (e.g., erlotinib).  5. Cellular microenvironment: Derived from metastatic site (pleural effusion); lacks significant immune cell infiltration in vitro.  6. Key biomarkers: KRAS G12C (therapeutic target), low LKB1 (prognostic marker), MET amplification (potential resistance driver).",
    "ACH-000510": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from a lymph node metastasis.  2. Molecular signatures:  - Common mutations: TP53 deletion, CDKN2A loss, KRAS mutation (G12C).  - Overexpression of c-MYC and BCL-2. EGFR wild-type.  3. Signaling pathways:  - Activated: MAPK/ERK (KRAS-driven), PI3K/AKT (BCL-2 mediated), mTOR.  - Inhibited: p53 pathway (due to TP53 deletion).  4. Known drug response profiles:  - Sensitive to KRAS inhibitors (e.g., sotorasib), BCL-2 inhibitors (e.g., venetoclax).  - Resistant to EGFR inhibitors (e.g., erlotinib).  5. Cellular microenvironment:  - Limited extracellular matrix interaction in vitro.  - Low immune cell infiltration (lymph node origin suggests adaptive immune evasion).  6. Key biomarkers:  - Prognostic: KRAS mutation status, BCL-2 expression.  - Therapeutic targets: KRAS G12C, BCL-2, c-MYC.",
    "ACH-000669": "SW900 Cell Line Description for Synergy Prediction  1. Cell Type and Origin:  - Derived from squamous cell carcinoma of the lung.  - Tissue source: Lung (NSCLC subtype).  2. Molecular Signatures:  - Common mutations: TP53, CDKN2A, PIK3CA.  - Overexpression: EGFR, MET.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR, MAPK/ERK.  - Dysregulated: Cell cycle (CDKN2A loss), apoptosis.  4. Known Drug Response Profiles:  - Sensitive: EGFR inhibitors (e.g., erlotinib), MET inhibitors.  - Resistant: Conventional chemotherapies (e.g., cisplatin).  5. Cellular Microenvironment:  - Limited extracellular matrix interaction in vitro.  - Low immune cell infiltration (typical for established carcinoma lines).  6. Key Biomarkers:  - Prognostic: TP53 mutation status.  - Therapeutic targets: EGFR, MET, PI3K.",
    "ACH-000264": "Cell Line: Calu-6  1. Cell Type and Origin:  - Derived from pleural effusion of a patient with lung adenocarcinoma (non-small cell lung cancer, NSCLC).  2. Molecular Signatures:  - Harbors mutations in KRAS (G12C), TP53 (R158L), and STK11 (loss), common in NSCLC.  - Low expression of EGFR; lacks EGFR mutations.  3. Signaling Pathways:  - Hyperactivated MAPK/ERK pathway due to KRAS mutation.  - Impaired AMPK signaling from STK11 loss, affecting metabolic regulation.  4. Known Drug Response Profiles:  - Sensitive to MEK inhibitors (e.g., trametinib) due to KRAS-driven MAPK activation.  - Resistant to EGFR-targeted therapies (e.g., erlotinib).  5. Cellular Microenvironment:  - Originated from pleural effusion, suggesting exposure to fluid-phase signaling factors.  - Limited data on immune cell presence; likely low immunogenicity.  6. Key Biomarkers:  - KRAS G12C as a primary therapeutic target.  - STK11 loss correlates with metabolic dysregulation and therapy resistance.",
    "ACH-000392": "1. Cell type and origin: Epithelial cell line derived from pleural effusion of lung adenocarcinoma.  2. Molecular signatures:  - Common mutations: _EGFR_ wild-type, _KRAS_ wild-type, _TP53_ mutation (R158L).  - Overexpresses _TMPRSS2_ and _ACE2_, making it permissive to SARS-CoV-2 infection.  3. Signaling pathways:  - Activated: PI3K/AKT, MAPK/ERK (moderate).  - Suppressed: TGF-β signaling.  4. Known drug response profiles:  - Sensitive to EGFR inhibitors (e.g., erlotinib) despite wild-type _EGFR_.  - Resistant to platinum-based chemotherapies (e.g., cisplatin).  5. Cellular microenvironment:  - Limited extracellular matrix interaction in vitro; lacks significant immune cell co-culture models.  6. Key biomarkers:  - Prognostic: High _TMPRSS2_ correlates with viral susceptibility.  - Therapeutic targets: _TMPRSS2_, _ACE2_, PI3K/AKT pathway.",
    "ACH-000337": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from lung tissue.  2. Molecular signatures: Harbors an EML4-ALK fusion (E13;A20 variant) and TP53 mutations; expresses ALK protein.  3. Signaling pathways: ALK-driven MAPK/ERK and PI3K/AKT pathways are constitutively activated.  4. Known drug response profiles: Sensitive to ALK inhibitors (e.g., crizotinib, alectinib); resistant to EGFR inhibitors.  5. Cellular microenvironment: Limited data; likely exhibits low immune infiltration due to in vitro culture.  6. Key biomarkers: EML4-ALK fusion (predictive for ALK inhibitor response); TP53 mutation (prognostic for aggressiveness).",
    "ACH-000779": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from lung tissue.  2. Molecular signatures: Harbors EGFR exon 19 deletion (E746-A750del); lacks ALK or ROS1 rearrangements. Overexpresses HER2 and MET in some variants.  3. Signaling pathways: Hyperactivated EGFR signaling via MAPK and PI3K-AKT pathways; potential crosstalk with MET or HER2.  4. Known drug response profiles: Sensitive to EGFR TKIs (e.g., gefitinib, osimertinib); resistant to chemotherapy (e.g., cisplatin) upon EGFR TKI resistance.  5. Cellular microenvironment: Minimal extracellular matrix interaction in vitro; limited data on immune cell coculture.  6. Key biomarkers: EGFR exon 19 deletion (predicts TKI response); T790M mutation (acquired resistance marker).",
    "ACH-000416": "1. Cell type and origin: Non-small cell lung cancer (NSCLC) cell line derived from a lymph node metastasis.  2. Molecular signatures: Common mutations include TP53 (R273H), KRAS (G12C), and STK11 loss; expresses epithelial markers (e.g., E-cadherin).  3. Signaling pathways: Hyperactivated RAS/MAPK and PI3K/AKT pathways due to KRAS mutation; mTOR pathway dysregulation from STK11 loss.  4. Known drug response profiles: Sensitive to MEK inhibitors (e.g., trametinib) and resistant to EGFR inhibitors (e.g., gefitinib).  5. Cellular microenvironment: Lymph node-derived; lacks significant extracellular matrix modeling in vitro; minimal immune cell interaction.  6. Key biomarkers: KRAS G12C (therapeutic target), TP53 R273H (prognostic), PD-L1 expression (immune checkpoint marker).",
    "ACH-000511": "### Calu-1 Cell Line Description (DepMap ID: ACH-000511)  1. Cell Type and Origin:  - Epithelial cell line derived from pleural effusion of a patient with lung squamous cell carcinoma (LSCC).  2. Molecular Signatures:  - Genetic mutations: KRAS G12C (driver mutation), TP53 loss, CDKN2A deletion.  - Protein expression: High EGFR, moderate PD-L1, low HER2.  3. Signaling Pathways:  - Activated: MAPK/ERK (KRAS-driven), PI3K/AKT (via EGFR).  - Inhibited: p53 pathway (due to TP53 mutation).  4. Known Drug Response Profiles:  - Sensitive: MEK inhibitors (trametinib), EGFR inhibitors (erlotinib, moderate).  - Resistant: Conventional chemotherapy (cisplatin), single-agent immunotherapy.  5. Cellular Microenvironment:  - Extracellular matrix: Fibronectin-rich, moderate collagen deposition.  - Immune cell presence: Low tumor-infiltrating lymphocytes (TILs), minimal macrophage interaction.  6. Key Biomarkers:  - Prognostic: KRAS G12C (poor prognosis), PD-L1 (moderate).  - Therapeutic targets: KRAS G12C, EGFR, MEK.",
    "ACH-000754": "Cell Line: L-428 (DepMap ID: ACH-000754)  1. Cell Type and Origin: Hodgkin lymphoma (classical), derived from pleural effusion.  2. Molecular Signatures: Overexpresses CD30 (TNFRSF8), CD15 (FUT4); mutations in STAT6, NFKBIA; Epstein-Barr virus (EBV)-negative.  3. Signaling Pathways: Constitutive NF-κB activation; JAK-STAT dysregulation; PI3K/AKT/mTOR pathway activity.  4. Known Drug Response Profiles: Sensitive to brentuximab vedotin (anti-CD30); resistant to conventional chemotherapy (e.g., doxorubicin) in relapsed/refractory cases.  5. Cellular Microenvironment: Minimal extracellular matrix interaction; lacks prominent immune cell infiltration (immune-evasion phenotype).  6. Key Biomarkers: CD30 (diagnostic/therapeutic target); PD-L1 expression (immune checkpoint); STAT6 phosphorylation (prognostic).",
    "ACH-000267": "### Cell Line Description: HDLM-2 (DepMap ID: ACH-000267)  1. Cell Type and Origin  - Hodgkin’s lymphoma cell line derived from a pleural effusion.  2. Molecular Signatures  - Harbors Epstein-Barr virus (EBV) infection.  - Overexpresses CD30 (TNFRSF8), a hallmark of Hodgkin’s lymphoma.  - Mutations in TP53, NFKBIA, and STAT6 reported.  3. Signaling Pathways  - Constitutive NF-κB activation due to NFKBIA mutations.  - JAK/STAT pathway dysregulation (STAT6 mutations).  - EBV-mediated LMP1 signaling promoting survival.  4. Known Drug Response Profiles  - Sensitive to brentuximab vedotin (anti-CD30 ADC).  - Resistant to conventional chemotherapy (e.g., doxorubicin).  - Responsive to proteasome inhibitors (e.g., bortezomib) due to NF-κB dependence.  5. Cellular Microenvironment  - Derived from pleural effusion, suggesting interaction with immune-rich fluid.  - Lacks robust extracellular matrix adherence (suspension culture).  - EBV presence may modulate immune evasion mechanisms.  6. Key Biomarkers  - CD30 (diagnostic and therapeutic target).  - PD-L1 expression (potential immune checkpoint relevance).  - EBV latency markers (e.g., LMP1, EBNA1).",
    "ACH-000017": "1. Cell type and origin: SK-BR-3 is a human breast adenocarcinoma cell line derived from a pleural effusion of a metastatic breast cancer patient.  2. Molecular signatures:  - Genetic mutations: HER2 (ERBB2) amplification, TP53 mutation (R175H), PIK3CA mutation (H1047R).  - Protein expression: High HER2 expression, estrogen receptor (ER)-negative, progesterone receptor (PR)-negative.  3. Signaling pathways:  - Activated: HER2/PI3K/AKT/mTOR pathway, MAPK/ERK pathway.  - Inhibited: Estrogen signaling (due to ER-negativity).  4. Known drug response profiles:  - Sensitive: Trastuzumab (anti-HER2), lapatinib (HER2/EGFR inhibitor), PI3K/mTOR inhibitors.  - Resistant: Endocrine therapies (e.g., tamoxifen, aromatase inhibitors).  5. Cellular microenvironment:  - Derived from pleural effusion, suggesting adaptation to fluid-phase growth.  - Limited data on extracellular matrix or immune cell interactions in vitro.  6. Key biomarkers:  - Prognostic: HER2 amplification (aggressive phenotype).  - Therapeutic targets: HER2, PI3K, mTOR.",
    "ACH-000859": "Cell Line: HCC1954  1. Cell Type and Origin: Epithelial cell line derived from primary breast adenocarcinoma (ductal carcinoma).  2. Molecular Signatures:  - Mutations: TP53 (R175H), PIK3CA (H1047R), PTEN loss.  - Amplifications: ERBB2 (HER2+), CCND1.  - Protein Expression: High HER2, ER/PR-negative.  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR (via PIK3CA mutation), HER2 signaling.  - Inhibited: PTEN tumor suppressor pathway.  4. Known Drug Response Profiles:  - Sensitive: HER2-targeted therapies (e.g., lapatinib, trastuzumab), PI3K/AKT inhibitors.  - Resistant: Endocrine therapies (due to ER/PR negativity).  5. Cellular Microenvironment:  - Low immune infiltration (limited PD-L1 expression).  - Extracellular matrix interactions typical of invasive ductal carcinoma.  6. Key Biomarkers:  - Prognostic: HER2 overexpression, PIK3CA mutation.  - Therapeutic Targets: HER2, PI3K, AKT.",
    "ACH-000876": "1. Cell type and origin: Epithelial cell line derived from metastatic breast adenocarcinoma; primary tissue source is pleural effusion.  2. Molecular signatures:  - Mutations: TP53 (R248Q), PIK3CA (E545K), CDH1 (splice site).  - Protein expression: ER-positive, PR-negative, HER2-negative (luminal B subtype).  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR (due to PIK3CA mutation), estrogen receptor signaling.  - Inhibited: Apoptosis (TP53 dysfunction).  4. Known drug response profiles:  - Sensitive: PI3K inhibitors (e.g., alpelisib), estrogen receptor modulators (e.g., tamoxifen).  - Resistant: HER2-targeted therapies (e.g., trastuzumab).  5. Cellular microenvironment:  - Minimal extracellular matrix interaction in vitro; lacks significant immune cell presence in standard culture.  6. Key biomarkers:  - Prognostic: High Ki-67 (proliferation marker).  - Therapeutic targets: ER, PI3K, CDH1 (potential for PARP inhibitor sensitivity due to genomic instability).",
    "ACH-000930": "1. Cell type and origin: Epithelial cell line derived from breast adenocarcinoma (primary disease: Breast Cancer).  2. Molecular signatures:  - Genetic mutations: TP53 mutation, PIK3CA mutation, PTEN loss.  - Protein expression: HER2-negative, ER/PR-negative (triple-negative profile).  3. Signaling pathways:  - Activated: PI3K/AKT/mTOR pathway (due to PIK3CA mutation, PTEN loss).  - Inhibited: RB pathway (common in triple-negative breast cancer).  4. Known drug response profiles:  - Sensitivity: PARP inhibitors (due to homologous recombination deficiency).  - Resistance: Endocrine therapies (ER/PR-negative).  5. Cellular microenvironment:  - Extracellular matrix: High fibronectin expression.  - Immune cell presence: Low tumor-infiltrating lymphocytes (immune-cold phenotype).  6. Key biomarkers:  - Prognostic markers: High Ki-67 (proliferation index).  - Therapeutic targets: PI3K/AKT/mTOR pathway components.",
    "ACH-000424": "Cell Line: TC-71 (DepMap ID: ACH-000424)  1. Cell Type and Origin:  - Ewing sarcoma cell line derived from bone tissue.  - Aggressive bone cancer model with mesenchymal origin.  2. Molecular Signatures:  - Characterized by EWSR1-FLI1 fusion gene (t(11;22) translocation), driving oncogenic activity.  - Overexpression of IGF-1R and CD99 (MIC2).  - Frequent mutations in STAG2, TP53, and CDKN2A.  3. Signaling Pathways:  - Hyperactivated IGF-1R/PI3K/AKT/mTOR pathway.  - Dysregulated Wnt/β-catenin and Notch signaling.  - EWSR1-FLI1-mediated transcriptional reprogramming.  4. Known Drug Response Profiles:  - Sensitive to IGF-1R inhibitors (e.g., figitumumab).  - Resistance to conventional chemotherapies (e.g., doxorubicin).  - Vulnerable to PARP inhibitors due to DNA repair defects.  5. Cellular Microenvironment:  - Minimal immune cell infiltration in vitro.  - Extracellular matrix interactions influence metastatic potential.  6. Key Biomarkers:  - EWSR1-FLI1 fusion (diagnostic and therapeutic target).  - CD99 (surface marker for detection).  - High IGF-1R expression (predictor of targeted therapy response).",
    "ACH-001751": "Cell Line: Rh36 (DepMap ID: ACH-001751)  1. Cell Type and Origin  - Cancer Type: Sarcoma (soft tissue origin).  - Tissue Source: Soft tissue.  2. Molecular Signatures  - Genetic Mutations: Specific mutations not well-documented; commonly harbors alterations in TP53, RB1, or PTEN typical of sarcomas.  - Protein Expression: Likely expresses sarcoma-associated markers (e.g., NY-ESO-1, SS18-SSX fusion in some subtypes).  3. Signaling Pathways  - Activated Pathways: PI3K/AKT/mTOR, MAPK/ERK (common in sarcomas).  - Inhibited Pathways: TGF-β signaling (frequent dysregulation in soft tissue sarcomas).  4. Known Drug Response Profiles  - Sensitivity: Doxorubicin, ifosfamide (standard sarcoma chemotherapies).  - Resistance: Potential resistance to EGFR inhibitors due to rare EGFR mutations in sarcomas.  5. Cellular Microenvironment  - Extracellular Matrix: High collagen deposition (typical of sarcoma stroma).  - Immune Cell Presence: Low to moderate tumor-infiltrating lymphocytes (TILs); immune-cold profile.  6. Key Biomarkers  - Prognostic Markers: Ki-67 (proliferation index), CDKN2A loss.  - Therapeutic Targets: PDGFR-α/β, IGF-1R (potential targets in sarcomas).",
    "ACH-000499": "Cell Line Description: EW-8 (DepMap ID: ACH-000499)  1. Cell Type and Origin:  - Derived from bone cancer (primary disease: Bone Cancer).  - Tissue source: Bone.  2. Molecular Signatures:  - Genetic mutations: Specific mutations not detailed in DepMap; commonly associated with bone cancer drivers (e.g., TP53, RB1).  - Protein expression: Likely overexpression of osteosarcoma-associated markers (e.g., RUNX2, SATB2).  3. Signaling Pathways:  - Activated pathways: PI3K/AKT/mTOR, Wnt/β-catenin (common in bone malignancies).  - Inhibited pathways: p53 tumor suppressor pathway (if TP53 mutated).  4. Known Drug Response Profiles:  - Sensitivity: Potential response to DNA-damaging agents (e.g., doxorubicin) and mTOR inhibitors.  - Resistance: Possible resistance to conventional chemotherapy due to heterogeneity.  5. Cellular Microenvironment:  - Extracellular matrix: High mineralized matrix typical of bone-derived cancers.  - Immune cell presence: Likely immunosuppressive (e.g., MDSCs, TAMs) based on bone tumor profiles.  6. Key Biomarkers:  - Prognostic markers: Elevated alkaline phosphatase (ALP), RUNX2.  - Therapeutic targets: CDK4/6, VEGF (angiogenesis inhibition potential).",
    "ACH-000793": "1. Cell type and origin: Epithelial cell line derived from gastric cancer, originating from pleural effusion.  2. Molecular signatures: Harbors mutations in TP53 and CDH1 (E-cadherin loss); overexpresses HER2 and c-MET.  3. Signaling pathways: Hyperactivated PI3K/AKT/mTOR and MAPK/ERK pathways due to HER2 amplification; Wnt/β-catenin dysregulation.  4. Known drug response profiles: Sensitive to HER2 inhibitors (e.g., trastuzumab) and MET inhibitors; resistant to 5-FU and cisplatin.  5. Cellular microenvironment: Minimal extracellular matrix interaction; low immune cell infiltration (immune-cold phenotype).  6. Key biomarkers: HER2 (predictive for anti-HER2 therapy), MET (potential target), E-cadherin loss (prognostic for invasiveness).",
    "ACH-000581": "Cell Line: SNU-16  1. Cell Type and Origin: Gastric adenocarcinoma derived from ascites.  2. Molecular Signatures:  - Mutations: TP53 (R175H), ARID1A (frameshift), RHOA (Y42C).  - Protein expression: Overexpression of HER2, MET; low E-cadherin (CDH1 loss).  3. Signaling Pathways:  - Activated: PI3K/AKT/mTOR, RAS/RAF/ERK, MET signaling.  - Inhibited: TGF-β pathway (SMAD4 loss).  4. Known Drug Response Profiles:  - Sensitive: Trastuzumab (HER2-targeted), MET inhibitors (e.g., crizotinib).  - Resistant: 5-FU, cisplatin (common chemotherapies).  5. Cellular Microenvironment:  - Ascites-derived; high cytokine levels (IL-6, VEGF).  - Minimal immune infiltration (low PD-L1 expression).  6. Key Biomarkers:  - Prognostic: HER2, MET (poor prognosis).  - Therapeutic targets: HER2, MET, PI3K.",
    "ACH-000714": "Cell Line: KMS-11  1. Cell Type and Origin: Human multiple myeloma cell line derived from a pleural effusion.  2. Molecular Signatures:  - Common mutations: KRAS (G12V), FAM46C (truncating), DIS3 (missense).  - Overexpression of CCND1 (cyclin D1) and MAF.  - Frequent copy number alterations (e.g., 1q gain, 13q loss).  3. Signaling Pathways:  - Hyperactivated MAPK/ERK pathway (KRAS-driven).  - Dysregulated PI3K/AKT/mTOR signaling.  - NF-κB pathway activation.  4. Known Drug Response Profiles:  - Sensitive to proteasome inhibitors (e.g., bortezomib, carfilzomib).  - Resistant to conventional chemotherapy (e.g., dexamethasone).  - Responsive to IMiDs (e.g., lenalidomide) but may develop resistance.  5. Cellular Microenvironment:  - Derived from malignant plasma cells in a liquid microenvironment (pleural effusion).  - Minimal extracellular matrix interaction in vitro.  - Limited native immune cell presence in culture.  6. Key Biomarkers:  - Prognostic: High CCND1 expression, KRAS mutation status.  - Therapeutic targets: CD38, SLAMF7, BCMA (for immunotherapy).",
    "ACH-000753": "Cell Line: JMSU-1  1. Cell type and origin: Derived from bladder cancer; tissue source is ascites.  2. Molecular signatures: Likely harbors bladder cancer-associated mutations (e.g., TP53, PIK3CA, FGFR3); potential overexpression of EGFR or HER2.  3. Signaling pathways: Activated PI3K/AKT and MAPK pathways; potential dysregulation in cell cycle and RTK signaling.  4. Known drug response profiles: Sensitivity to platinum-based chemotherapies (e.g., cisplatin); potential resistance to taxanes; investigational FGFR inhibitors may show efficacy.  5. Cellular microenvironment: Ascites-derived, suggesting exposure to peritoneal fluid cytokines; potential immune-suppressive factors (e.g., TGF-β, IL-10).  6. Key biomarkers: Potential biomarkers include FGFR3 alterations, ERBB2 amplification, and PD-L1 expression (immune checkpoint relevance).",
    "ACH-000242": "1. Cell type and origin: Epithelial cell line derived from urinary tract; primary disease: Bladder Cancer (non-muscle invasive).  2. Molecular signatures:  - Mutations: FGFR3-TACC3 fusion, TP53 mutation, CDKN2A deletion.  - Protein expression: Overexpression of EGFR, HER2; low PD-L1.  3. Signaling pathways:  - Activated: FGFR3, PI3K/AKT, MAPK/ERK.  - Inhibited: p53 pathway (due to TP53 mutation).  4. Known drug response profiles:  - Sensitive: FGFR inhibitors (e.g., erdafitinib), EGFR inhibitors.  - Resistant: Conventional chemotherapy (e.g., cisplatin).  5. Cellular microenvironment:  - Limited extracellular matrix interaction; low immune cell infiltration (immune-cold phenotype).  6. Key biomarkers:  - Prognostic: FGFR3-TACC3 fusion (predicts FGFR inhibitor response).  - Therapeutic targets: FGFR3, EGFR, HER2.",
    "ACH-000956": "1. Cell type and origin: Prostate cancer cell line derived from a human prostate carcinoma xenograft (CWR22R).  2. Molecular signatures: Harbors androgen receptor (AR) amplifications and mutations (e.g., H874Y), PTEN loss, and TMPRSS2-ERG fusion. Expresses prostate-specific antigen (PSA).  3. Signaling pathways: Androgen receptor (AR) pathway activation, PI3K/AKT/mTOR dysregulation due to PTEN loss, and ERG overexpression via TMPRSS2-ERG fusion.  4. Known drug response profiles: Sensitive to AR antagonists (e.g., enzalutamide), resistant to docetaxel in later stages. Responsive to PI3K/AKT inhibitors.  5. Cellular microenvironment: Lacks significant immune cell infiltration in vitro; extracellular matrix interactions mimic prostate cancer stroma.  6. Key biomarkers: AR variants (e.g., AR-V7), PSA, PTEN loss, and TMPRSS2-ERG fusion serve as prognostic markers and therapeutic targets.",
    "ACH-000164": "1. Cell type and origin: Pancreatic ductal adenocarcinoma (PDAC) cell line derived from pancreatic tissue.  2. Molecular signatures:  - Mutations: KRAS (G12D), TP53 (R273C), CDKN2A (loss).  - Protein expression: High EGFR, MET, and HER2; low PTEN.  3. Signaling pathways:  - Activated: RAS/RAF/MEK/ERK, PI3K/AKT/mTOR, Wnt/β-catenin.  - Inhibited: TGF-β signaling (SMAD4 loss).  4. Known drug response profiles:  - Sensitive: Gemcitabine (moderate), MEK inhibitors (e.g., trametinib).  - Resistant: EGFR inhibitors (e.g., erlotinib), single-agent PARP inhibitors.  5. Cellular microenvironment:  - Extracellular matrix: High fibronectin and collagen I deposition.  - Immune cell presence: Low tumor-infiltrating lymphocytes (immune-excluded phenotype).  6. Key biomarkers:  - Prognostic: High CA19-9, KRAS mutation status.  - Therapeutic targets: KRAS (G12D), MET, HER2.",
    "ACH-000002": "1.Cell type and origin: Acute promyelocytic leukemia (APL) cell line derived from peripheral blood of a 36-year-old female patient.2.Molecular signatures: Harbors FLT3-ITD and NRAS mutations; expresses high levels of myeloperoxidase and CD33 surface antigen; exhibits PML-RARA fusion gene characteristic of APL.3.Signaling pathways: Constitutively activated MAPK/ERK and PI3K/AKT pathways; aberrant JAK/STAT signaling; retinoid signaling pathway present but dysregulated.4.Known drug response profiles: Highly sensitive to all-trans retinoic acid (ATRA) and arsenic trioxide; exhibits resistance to conventional chemotherapeutic agents like cytarabine in baseline state; used as a model for differentiation therapy.5.Cellular microenvironment: Grows in suspension culture without adhesion requirements; lacks native extracellular matrix interactions; no endogenous immune cell presence in standard in vitro models.6.Key biomarkers: PML-RARA fusion oncoprotein serves as primary therapeutic target; CD33 (SIGLEC-3) is validated target for antibody-based therapies; FLT3 mutations contribute to prognostic assessment.",
    "ACH-000977": "1.Cell type and origin: Prostate adenocarcinoma cell line derived from a metastatic lesion in the left supraclavicular lymph node of a 50-year-old male patient.2.Molecular signatures: Androgen receptor (AR) positive with AR amplification; expresses mutant AR (T878A); harbors PTEN deletion and TMPRSS2-ERG gene fusion; exhibits PSA (KLK3) expression.3.Signaling pathways: Androgen receptor signaling is constitutively active; PI3K/AKT/mTOR pathway hyperactivated due to PTEN loss; MAPK pathway signaling present; responsive to steroid hormone stimuli.4.Known drug response profiles: Androgen-dependent growth, sensitive to anti-androgens (e.g., enzalutamide) and AR signaling inhibitors; exhibits resistance to taxanes upon progression; model for castration-resistant progression studies.\n5.\nCellular microenvironment: Grows as adherent epithelial clusters in vitro; lacks native stromal or immune components in standard culture conditions; used in co-culture models to study bone metastasis interactions.6.Key biomarkers: Androgen receptor is the primary therapeutic target; PSA (KLK3) secretion serves as a treatment response marker; PTEN loss is a prognostic biomarker; TMPRSS2-ERG fusion is a disease-specific marker.",
    "ACH-000202": "1.Cell type and origin: Colorectal adenocarcinoma cell line derived from a primary tumor of the colon in a 55-year-old male patient.2.Molecular signatures: Harbors a homozygous nonsense mutation in APC; exhibits MYC amplification and overexpression; expresses mutant p53 (R273H); negative for microsatellite instability (MSS).3.Signaling pathways: Constitutive activation of Wnt/-catenin signaling due to APC loss; dysregulated cell cycle progression via MYC overexpression; MAPK and PI3K/AKT pathways are active.4.Known drug response profiles: Sensitive to inhibitors of Wnt signaling and MYC-targeting compounds; exhibits resistance to 5-fluorouracil and other conventional chemotherapies; used in models for targeting MYC-driven cancers.5.Cellular microenvironment: Grows in semi-adherent clusters and suspension in vitro; lacks native stromal or immune components in standard culture; used in xenograft models for colorectal cancer progression.6.Key biomarkers: MYC oncoprotein is a primary therapeutic target; APC mutation is a key driver alteration; -catenin accumulation serves as a pathway activation marker."
}